[ {"model": "api.job", "pk": 93, "fields": {"title": "Junior DevOps Engineer", "description": "<h2>Company Description</h2>\n<p>RockCreek is a leading global investment firm that applies cutting-edge technology and innovation to investments. We strive to generate returns and be at the forefront of change through public and private market investments in developed, emerging and frontier markets. Our talented team embodies a culture of curiosity, debate and a relentless drive to excel. While our core competency is investment, we value our technology as a key part of our service offerings. We prioritize providing our team and our clients best-of-breed applications and APIs to view and manage funds and portfolios across our broad range of investment offerings.</p>\n<h2>Job Description</h2>\n<p>RockCreek is looking for a Junior DevOps Engineer in support of a growing set of cloud-based tools and applications. This position offers an opportunity to contribute immediately to a growing engineering team while still offering opportunities to grow and be mentored by experienced cloud engineers. The ideal candidate will be eager to learn and proactive in asking questions and working on outstanding projects.</p>\n<p>Although travel is not expected to be frequent, the Junior DevOps Engineer should, if not located in the Washington, D.C. area, meet with the team for in-person planning and work sessions.</p>\n<h2>Qualifications</h2>\n<p>Requirements:</p>\n<ul>\n<li>Previous experience operating and troubleshooting AWS environments, especially ones that host web and multi-tier applications</li>\n<li>Experience with the following AWS services:\n<ul>\n<li>EC2</li>\n<li>RDS (preferably PostgreSQL and SQL Server)</li>\n<li>CloudFormation templates</li>\n<li>CloudWatch</li>\n<li>CloudTrail</li>\n</ul>\n</li>\n<li>Bash (or equivalent) shell scripting</li>\n<li>High proficiency in written and verbal English communication skills</li>\n</ul>\n<p>Desired Skills:</p>\n<ul>\n<li>Knowledge of AWS reference architectures, particularly in the context of:\n<ul>\n<li>API Gateway</li>\n<li>Lambda functions and triggers from other AWS managed services</li>\n</ul>\n</li>\n<li>Ruby, Python, and/or JavaScript</li>\n<li>Application development in an Agile environment, with daily standups and ticketing</li>\n<li>AWS and/or Google Cloud certifications (especially the Certified Solutions Architect track in AWS)</li>\n<li>Experience in investment applications or working with the investment and/or financial industry</li>\n</ul>\n<h2>Interested?</h2>\n<p>Please apply via  <a href=\"https://therockcreekgroup.redirect.your-jobresponse.com/junior_devops_engineer_washington/241667/V819/apply\">this link</a></p>\n<h2>Additional Information</h2>\n<h2>The RockCreek Environment</h2>\n<p>RockCreek is a collaborative environment that values openness, transparency, partnership, and knowledge sharing. In a typical day you will interact with members of all of our teams; engineering is neither siloed nor cut off from the overall RockCreek business. You should be both interested and capable of learning the investment business as it relates to design and engineering, and creatively looking to enhance the overall RockCreek service offerings.</p>", "location": "Washington", "company": "RockCreek", "appLink": "<p><a href=\"https://therockcreekgroup.redirect.your-jobresponse.com/junior_devops_engineer_washington/241667/V819/apply\">Click here to apply!</a></p>"}}, {"model": "api.job", "pk": 94, "fields": {"title": "Working Student DevOps (f/m/x)", "description": "<p>Mobisol Group is a leading global player in decentralised solar electrification. Driven by market demand for off-grid solutions beyond lighting, Mobisol designs, distributes and services large solar systems, seamlessly integrated with proprietary pay-as-you-go (PAYG) software. By combining the latest high-tech solar hardware with mobile payment technologies, the Berlin based company ensures affordability through flexible payment plans. Mobisol enables rural families and businesses to power a wide range of compatible appliances, such as televisions and stereos, thereby improving people's standard of living and enabling incremental income from new solar-powered businesses. With over 750 employees, Mobisol runs its own operations in Tanzania, Kenya and Rwanda, while providing hardware and software solutions through a growing network of B2B partnerships in another nine countries worldwide.</p>\n<p><strong>WHAT THIS JOB IS ABOUT</strong></p>\n<p>Paygee is part of the Mobisol group and will be the digital foundation for a new and fast-growing market, the Pay-As-You-Go-market, especially in Africa. Paygee enables distributors from the off-grid market, to sell their goods via microcredit to people which normally not could afford these products and services. Paygee hereby improves living standards by e.g. granting access to light through green energy, clean water via water filter and the opportunity to set up own businesses via affordable access to energy. Paygee is already the technology partner of different companies in the off-grid market.</p>\n<p>In 2018 Mobisol´s Paygee branch opened the business for external partners with the IT infrastructure growing quickly.\nAs Working Student DevOps you´ll make sure, that our internal applications and in particular our SaaS \"Soloarhub\" are always available for us and our external customers. <strong>You will gather deep insights into our cloud infrastructure and the processes of setting up new services and infrastructure.</strong></p>\n<p>As part of a small team of three people which support the Paygee Software Development branch, <strong>you will be in touch with customers, software developers and third-party providers mainly in East Africa</strong> to secure the smooth and stable running of our web services at all times.</p>\n<p><strong>YOUR TASKS</strong></p>\n<ul>\n<li>\n<strong>Planning, setting up and maintaining IT solutions in collaboration with the senior software engineers</strong> i.e. server infrastructure especially for our SaaS “Solarhub”</li>\n<li>\n<strong>Executing release and maintenance processes of backend software</strong>, focussing on continuous automation of  these processes</li>\n<li>\n<strong>Ensuring, advancing and documenting stable IT operations</strong>, e.g. telecommunication software solutions and technical integration of IT service providers and Mobile Network Operators by monitoring performance and logs of applications, infrastructure, and hardware including the creation of back-ups of production data</li>\n</ul>\n<p><strong>YOUR QUALIFICATIONS</strong></p>\n<ul>\n<li><strong>Most important for us is not your experience but your motivation to learn and to work with the technologies we are using</strong></li>\n<li>You have the passion for discovering, evaluating and implementing new technical solutions by yourself</li>\n<li>You are a team player with excellent communication skills, English is the company language</li>\n<li>You have an interest in managing Linux servers</li>\n<li>You are available for extra paid weekend support once a month</li>\n<li>You have an interest in modern web technologies</li>\n<li>You have a good technical and methodological understanding</li>\n<li>You are a trouble shooter with an aptitude for problem solving</li>\n</ul>\n<p><strong>OUR TECH-STACK</strong></p>\n<ul>\n<li>\n<strong>Our complete software</strong> for our business like mobile applications, backend, and our firmware <strong>is built in-house</strong>\n</li>\n<li>Following technologies are used by us: <strong>Ansible</strong>, MySQL, Capistrano, Ruby on Rails, Kafka, Cassandra, IPsec, <strong>Linux</strong> Containers, <strong>HAProxy</strong>, Nginx, <strong>Docker, Kubernetes, Zabbix</strong>, Grafana</li>\n</ul>\n<p><strong>YOUR PERSPECTIVE</strong></p>\n<p>WHAT HAPPENS IN THE FIRST 6 MONTHS?</p>\n<ul>\n<li>In your first month you will gather information about our software architecture and technology stack</li>\n<li>Until the end of the first three months, you will be able to maintain and improve our service (Ansible) and our monitoring (Zabbix)</li>\n<li>Until the end of your first six months, you will improve the daily processes of our developers and be able to solve emergency requests</li>\n</ul>\n<p>WHAT ELSE?</p>\n<ul>\n<li>\n<strong>Get in shape for your professional career</strong> – In our team of experienced software engineers you will get in touch with new tools, new processes and new challenges every day but you will never be left alone with it</li>\n<li>\n<strong>Doing something meaningful</strong> - you´ll become part of an enterprise, that brings real positive impact to energy-poor households in East Africa</li>\n<li>\n<strong>Be part of a great team of people</strong> – which share the vision to plug in the world</li>\n<li>\n<strong>Flat hierarchies and unconventional ways of doing things</strong> – your ideas and experiences are more than welcome</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/e04b69902729af55c4a83e45f514ee5d052bdde9/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f633f6369643d36363263393430372d663863622d343032342d613136392d393063316334356463666234266a69643d30343661613264652d353539352d343033642d386137652d346635306361303739303537267069643d61653365633634302d353530622d343165662d626330612d3434653363643430386430342665633d76696577253341706978656c2663623d687474707325334125324625324673332d65752d776573742d312e616d617a6f6e6177732e636f6d253246676f686972696e672d7075626c69632d617373657473253246706978656c2e676966\"></p>", "location": "Berlin", "company": "Mobisol GmbH", "appLink": "<p><a href=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=046aa2de-5595-403d-8a7e-4f50ca079057&amp;pid=ae3ec640-550b-41ef-bc0a-44e3cd408d04&amp;ec=click%3Aapply_url&amp;cb=https%3A%2F%2Fmobisol-jobs.personio.de%2Fjob%2F100872%23apply\">application form</a></p>"}}, {"model": "api.job", "pk": 95, "fields": {"title": "Full Stack Developer - Go, JavaScript, Ruby / Rails", "description": "<p>We're an agile, fast-growing data engineering and analytics company headquartered in downtown Seattle. We build scalable solutions and models for companies that impact tens of millions of customers.</p>\n<p>We’re looking for a talented full stack developer to join our small, collaborative team. You will have the opportunity to work on both front-end and back-end components across a variety of architectures, from single-page apps in React to API servers in Go. The successful candidate is detail-oriented, has excellent communication skills, loves to work on cutting edge technology and has a knack for problem solving.</p>\n<p>Your Qualifications:</p>\n<ul>\n<li>4+ years of software development: Ruby / Rails, JavaScript frameworks, Go</li>\n<li>2+ years of experience working with cloud based platforms and services such as AWS, Azure or Google Cloud Platform</li>\n<li>Experience with popular modern CI/CD tools</li>\n<li>Experience with building data pipelines and using big data frameworks is a plus</li>\n<li>Must be curious, tenacious and humble</li>\n</ul>\n<p>Your Responsibilities:</p>\n<ul>\n<li>Work closely and with team members to build product and platform features</li>\n<li>Participate in project planning and customer discussions</li>\n</ul>", "location": "Seattle", "company": "Siimpl", "appLink": "<p>send resume and repo link to <a href=\"mailto:jobs@siimpl.io\">jobs@siimpl.io</a></p>"}}, {"model": "api.job", "pk": 96, "fields": {"title": "Software Solutions Architect - Remote", "description": "<p><a href=\"citrusbyte.com\">Citrusbyte</a> is a team of experts who set sound principles and best practices into action. Our team solves complex problems and builds amazing things for some of the largest global household names. We work with team members around the world and have offices in LA and New York. This is a remote first role.</p>\n<p>This role will require some travel to client sites as necessary. You must be authorized to work in the United States.</p>\n<p>As <strong>Software Solutions Architect</strong>, you are a polyglot engineer with a hunger for learning new languages and tools. You see yourself as a maker and you are interested in all steps of the process, from understanding the challenge, to designing, developing and deploying.</p>\n<p>As a consulting Software Solutions Architect, you are always happy to be learning, choosing the right tool for the job but also becoming the foremost domain expert about our client’s business. You should always be able to answer the question: What have I learned this week?</p>\n<p><strong>Responsibilities and Duties:</strong></p>\n<p>In this role, you will participate in the full life cycle of application development for our clients with duties including but not limited to:</p>\n<ul>\n<li>Assist the sales team with uncovering and understanding technical requirements and producing estimates and risk assessments for new projects.</li>\n<li>Become the domain expert for our clients’ business and gain a deep knowledge of their infrastructure and internal systems.</li>\n<li>Assess and research technologies to determine their fitness for a particular purpose.</li>\n<li>Educate and train clients and stakeholders about the benefits of our approach and process to software and solutions development.</li>\n<li>Collaborate with the engineering team on project delivery by contributing code and reviewing pull requests.</li>\n<li>Collaborate with the team to create a successful project hand-off plan</li>\n</ul>\n<p><strong>Qualifications and Skills:</strong></p>\n<ul>\n<li>10+ years of experience in software engineering.</li>\n<li>Over 5+ years of experience directly consulting with clients.</li>\n<li>Eager to learn new languages and technologies.</li>\n<li>Proficient and experienced with at least 3 programming languages; JavaScript, Ruby, Elixir, Go, C# and Python are all a plus.</li>\n<li>Strong experience designing and delivering features on both server and client sides of the development stack.</li>\n<li>Experience with AWS, GCP, or Azure.</li>\n<li>Experience working with Chef, Ansible, and other provisioning technologies is a plus.</li>\n<li>BS of Computer Science or similar academic background is a plus.</li>\n<li>Excellent skills in spoken and written English language.</li>\n<li>Possess a strong and reliable internet connection.</li>\n</ul>\n<p><strong>Benefits at Citrusbyte:</strong></p>\n<p>While we have offices in LA and New York, we work remotely with team members around the world</p>\n<ul>\n<li>\n<strong>Remote first</strong> - Work from your remote location if you are not called to travel to client site</li>\n<li>\n<strong>Team retreats</strong> - We get together at an inspiring location to meet, work and play</li>\n<li>\n<strong>Healthy body, healthy mind - happy team</strong> - We offer vacation and support healthy lifestyles through our physical fitness and continuing education benefits program.</li>\n</ul>\n<p><em>Citrusbyte expects team members to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, skills development decisions such as training, and all other terms and conditions of our relationship, will be made without regard to race, nationality, national origin, citizenship status, employment engagement status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination.</em></p>\n<p><em>Citrusbyte is an equal opportunity employer.</em></p>\n<p><em>No statements by Citrusbyte are intended to create an offer of employment unless made in a writing signed by an officer of the company and no offer shall become effective unless countersigned by the prospective employee.</em></p>", "location": "Remote", "company": "Citrusbyte", "appLink": "<p>Apply directly <a href=\"https://citrusbyte.applytojob.com/apply/WLPNjpqVlF/Software-Solutions-Architect-Remote?source=GitHub%20Jobs\">on our careers page</a>.</p>"}}, {"model": "api.job", "pk": 97, "fields": {"title": "Software Engineer (Backend API)", "description": "<p>Evidation Health is a new kind of health and measurement company that provides the technology and guidance to understand how everyday behavior and health interact. The volumes of behavior data generated from wearables and smartphones has opened up new ways to analyze individuals’ behavior and health in real time. With a virtual pool of 2 million research participants, Evidation Health undertakes research for innovative biopharma and health care companies to transform how diseases are identified, treated, and monitored.</p>\n<p>We’re seeking a highly motivated Software Engineer (Backend API) to join our Enterprise Engineering team who is familiar with scalable architectures, data flows, and APIs. We value problem solving skills, continuous learning, great communication and accountability. If you thrive on autonomy, open-ended challenges, and designing large-scale software systems, this is the perfect opportunity.</p>\n<p>RESPONSIBILITIES</p>\n<ul>\n<li>Develop API’s and integrations for a large-scale, cloud-based application</li>\n<li>Build and implement microservices to improve scalability and performance</li>\n<li>Participate in the full software development lifecycle, including development, code reviews, testing and production</li>\n</ul>\n<p>QUALIFICATIONS</p>\n<p>Minimum Qualifications:</p>\n<ul>\n<li>2+ years developing in Ruby on Rails, Python, Go, Java, or C++</li>\n<li>Undergraduate degree or equivalent experience in Computer Science or related technical field</li>\n<li>Experience with Postgres or MySQL</li>\n<li>Experience writing unit tests and integrations</li>\n</ul>\n<p>Preferred Qualifications:</p>\n<ul>\n<li>Experience working with RESTful frameworks</li>\n<li>Experience with cloud platforms (AWS or Google)</li>\n<li>Experience working with scalable API frameworks</li>\n</ul>\n<p>BENEFITS</p>\n<ul>\n<li>Health, dental, and vision benefits for you and competitive coverage for your family</li>\n<li>Relocation support</li>\n<li>Equity</li>\n<li>Flexible work hours</li>\n<li>Open vacation policy - take time when you need it</li>\n<li>Support for remote work when needed</li>\n<li>Relaxed work environment</li>\n<li>Your choice of computing equipment and gear</li>\n<li>Lots of opportunities for growth</li>\n<li>Opportunity to work on fascinating challenges that improve people’s lives</li>\n</ul>\n<p>Evidation Health values diversity and is committed to equal opportunity for all persons without regard to race, color, creed, religion, marital status, age, national origin or ancestry, political activity or affiliation, physical or mental disability, medical condition including genetic characteristics, marital status, sexual orientation, gender identity, sex or gender.</p>\n<p><a href=\"http://www.evidation.com\">www.evidation.com</a></p>", "location": "San Francisco Bay Area", "company": "Evidation Health", "appLink": "<p><a href=\"https://evidation.recruiterbox.com/jobs/fk0j3n8/\">https://evidation.recruiterbox.com/jobs/fk0j3n8/</a></p>"}}, {"model": "api.job", "pk": 98, "fields": {"title": "Full Stack Software Engineer & Sr Analyst", "description": "<p>Position Overview:\nWe are seeking an experienced Software Engineer to help us design and build Acadian’s advanced browser-based, interactive, analytical platform that helps us better understand, explain, and improve our quantitative investment process. This is a hands-on, full-stack development role that provides growth and learning opportunities. The Software Engineer will utilize and hone a variety of technical skills while gaining and applying quantitative investment knowledge. Our small team is embedded within the investment group, providing the opportunity to see your work in action. Join us to leverage your software development skills and work with world class technology and investment experts.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Design, build, test, and support multi-tiered distributed, clustered, web-based applications and platforms</li>\n<li>Engineer, design, and build scalable, interactive, responsive, informative, and beautiful data visualization and exploration tools</li>\n<li>Team up with quantitative portfolio managers and researchers to develop and execute process improvement initiatives through software development</li>\n</ul>\n<p>Qualifications:</p>\n<ul>\n<li>Experience building browser-based applications using JavaScript, CSS, and HTML</li>\n<li>Experience programming using a server-side scripting language such as Python (Node, Ruby, Julia, etc.)</li>\n<li>Degree in Computer Science or equivalent knowledge and technical work experience</li>\n<li>Hands on experience running http server such as Apache / NGINX</li>\n<li>Prior investment/financial industry knowledge is not required</li>\n</ul>\n<p>Other technologies we use:</p>\n<ul>\n<li>SQL, NoSQL, MongoDB, Redis</li>\n<li>Numpy, Scipy, Pandas</li>\n<li>D3, AngularJS, Node</li>\n<li>Docker, Slurm, ZeroMQ, AWS</li>\n</ul>\n<p>It is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.</p>", "location": "Boston", "company": "Acadian Asset Management", "appLink": "<p>To apply for this position, please visit the Careers section of our website at <a href=\"https://www.acadianasset.com/careers/job-opportunities?postid=_O73hMPGD5U\">https://www.acadianasset.com/careers/job-opportunities?postid=_O73hMPGD5U</a>. We will contact only selected candidates.</p>"}}, {"model": "api.job", "pk": 99, "fields": {"title": "Software Engineer - Remote", "description": "<p>Hireology’s technology empowers businesses to build great teams. Over the last eight years, we’ve grown from a startup to a market-leading organization with over 175 team members and built an award-winning culture that makes this company an amazing place to work. It’s with that in mind that Hireology is looking to add a Software Engineer to our team.</p>\n<p>Hireology is based in Chicago, but our Engineering and UX teams work remotely, so you’ll have the option of working from the comfort of your home or right in our office if you’re local. Compensation is competitive, and we offer a full benefits package. We have regular company-wide events, semi-annual team gatherings, and frequent celebrations when we hit our goals.</p>\n<p>As our Software Engineer, you'll be responsible for:</p>\n<p>Help implement an easy to use, continuously deployed product\nParticipate in DevOps tasks, design reviews, writing stories, coding modules, code reviews, unit testing and automated acceptance testing\nCollaborate with experienced software developers in the design, development, maintenance of our application\nPartner closely with our product and business teams to ensure that we are delivering the best possible outcomes for our internal and external customers</p>\n<p>So what kind of person are we looking for in this role? We have a pretty unique culture here at Hireology, and the person who will be successful in this role will be:</p>\n<p>Results Obsessed: You are passionate about measuring and driving demonstrable results through\nour efforts\nExpert: You are an authority in the software development space, bringing your knowledge and passion to Hireology\nThink Strategically: Data-savvy when it comes to driving performance and a driven individual who can accelerate the growth of our product</p>\n<p>Okay, we’ve laid out what the job is - now are you qualified? Below are the minimum qualifications we’re looking for in a Software Engineer. Also, we want a chance to get to know who you are and why you applied, so please include a cover letter.</p>\n<p>3+ years of experience writing applications with Ruby on Rails\nExperience with Golang or other strongly typed languages\nFamiliar with service-oriented architectures\nExcited about delivering quality and are familiar with unit and acceptance testing frameworks\nKnowledgeable with third party API integrations\nComfortable in a modern software engineering environment with distributed source code control, dev/stage/prod release cycle, extensive testing, and continuous deployment\nExperienced with HTML5, CSS, JavaScript\nFearless about learning new technologies and technical approaches to application development\nAuthorized to work in the United States</p>\n<p>So what can you expect after you apply? You will:</p>\n<p>Take a brief true/false survey. Be sure to check your email after you apply.\nHave a phone conversation with someone on our Recruiting team. This is a high-level conversation about you, but also a good opportunity for you to learn more about us.\nMeet with one of our Software Engineers to talk shop. Be prepared to talk about how you approach work technically with examples of how you have done it in the past. No homework or on-the-spot assignments. We just want to nerd out a bit with you.\nGo over your career history with our Vice President of Engineering. This will be an opportunity for us to get an idea of how you got to where you are, and if where you want to go lines up with where we are going.\nMeet virtually with some more of the remote team. We want to give you some idea of the people you will be working with. We ask the serious questions here, like your top three movies.\nProvide us some references. We use our automated reference check system for this, so you just give us some names, they fill out a survey, and we are all set.\nSpeak with a member of our leadership team. If you have made it this far, just be yourself, and everything will be fine.</p>", "location": "Chicago, IL, USA", "company": "Hireology", "appLink": "<p><a href=\"https://www.hireology.com/careers/?hireology_job_id=255103\">https://www.hireology.com/careers/?hireology_job_id=255103</a></p>"}}, {"model": "api.job", "pk": 100, "fields": {"title": "Software Developer 3.0", "description": "<p><strong>#Be part of something</strong>\ndynamic</p>\n<p>CGI heeft de slagkracht en de grootte om zelfs de meest ambitieuze IT-carrières vorm te geven. Doordat wij een stabiele en groeiende organisatie zijn, kunnen wij je uitstekende kansen bieden om in een ondersteunende omgeving te werken aan projecten die daadwerkelijk impact hebben op onze wereld.</p>\n<p>CGI heeft voor haar locatie in Groningen een vacature voor een</p>\n<p><strong>Software Developer 3.0</strong>\nFulltime</p>\n<p><strong>Wat ga je doen als Software Developer?</strong>\nJe hebt ervaring met meerdere (ontwikkel)talen, tools en platformen. Hierdoor ben je in staat om onze klanten de allerbeste oplossingen te bieden. Samen met 250 enthousiaste collega’s, werk je aan projecten o.a. op gebied van digitale transformatie, Internet of Things, SmartBuilding en Energie Transities. Projecten worden uitgevoerd op ons kantoor in Groningen en bij klanten in de regio. Je zet graag de extra stap die nodig is voor jouw persoonlijke ontwikkeling en wilt alleen het beste voor onze klanten.</p>\n<p><strong>Wat breng je mee</strong>\nAls je een enthousiaste Java Developer bent:</p>\n<ul>\n<li>Ruime ervaring met Java, JEE, (No)SQL, XML, SOAP, REST, Json , Spring, Hibernate, Application servers (JBOSS/Jetty/Tomcat/Wildlfy), Maven, Angular, Junit, Mockito, IDE(Intellij/Eclipse/Netbeans);</li>\n<li>Ervaring met programmeertalen als Python, Perl, JavaScript, Go, Scala, Ruby.</li>\n</ul>\n<p><strong>Een gedreven Oracle Developer:</strong></p>\n<ul>\n<li>Ruime ervaring met Apex, Oracle PL/SQL, TOAD;</li>\n<li>Kennis en ervaring met WebLogic Server, JBoss.</li>\n</ul>\n<p><strong>of een energieke Front end Developer:</strong></p>\n<ul>\n<li>Expert in Drupal 6, 7, 8, Drupal backend en PHP;</li>\n<li>Kennis van HTML 5, Javascript, JQuery, Angular en/of My SQL.</li>\n</ul>\n<p><strong>In elk geval heb jij:</strong></p>\n<ul>\n<li>Een afgeronde HBO/WO-opleiding in de ICT of een technische richting;</li>\n<li>Minimaal 1 jaar (junior), 3 jaar (medior) of 5 jaar (senior) relevante werkervaring;</li>\n<li>Ervaring met continuous integration en delivery én Cloud development;</li>\n<li>Ruime ervaring met één of meer van de volgende databases: Oracle 11g / 12c, MS SQL server, MySQL, PostgreSQL, Redic, MongoDB;</li>\n<li>Pré: Ervaring met testtools zoals SoapUI, Selenium, Cucumber, ATS en testautomatisering.</li>\n</ul>\n<p><strong>Waar kom je terecht</strong>\nCGI is dé innovatieve leverancier die wereldwijde kennis van business, branches en technologische know-how met elkaar samenbrengt. Met onze speerpunten: IT Modernization, Cybersecurity, Big data analytics en Enterprise Mobility, helpen we de regionale klanten in het realiseren van hun digitale toekomst.</p>\n<p>Wij bieden je een uitdagende functie in Noord Nederland inclusief uitstekende arbeidsvoorwaarden.</p>\n<p><strong>Wij willen het beste uit jou halen</strong>\nWanneer je bij CGI gaat werken kom je terecht op een uitdagende werkvloer met professionele collega’s en ben je de bouwsteen binnen een hechte community. We stimuleren je in jouw ontwikkeling en bieden je hiervoor alle ruimte. Doorgroeien is vanzelfsprekend.</p>\n<p><strong>Wat biedt CGI jou?</strong></p>\n<ul>\n<li>Fantastische carrièrekansen</li>\n<li>Werk dat ertoe doet</li>\n<li>Zelfsturende teams</li>\n<li>Een ownership cultuur</li>\n<li>Persoonlijk leer- en ontwikkelprogramma</li>\n<li>Gezondheids- en welzijnsprogramma</li>\n<li>Mobiliteitsvergoeding</li>\n</ul>\n<p><strong>Meer informatie</strong>\nNeem voor vragen over de sollicitatieprocedure contact op met afdeling Recruitment via (088) 564 00 00.</p>\n<p>Bezoek voor meer informatie over CGI: <a href=\"http://www.cginederland.nl\">www.cginederland.nl</a></p>", "location": "Rotterdam", "company": "CGI", "appLink": "<p>Klik hier om te reageren --&gt; <a href=\"https://cgi.njoyn.com/cgi/xweb/xweb.asp?clid=21001&amp;page=jobdetails&amp;jobid=J0517-2073&amp;BRID=EX548790&amp;SBDID=1&amp;LANG=9&amp;utm_source=adveronline-vacatureplaatsing&amp;utm_medium=github&amp;utm_campaign=software-developer\">solliciatiepagina </a>:</p>"}}, {"model": "api.job", "pk": 101, "fields": {"title": "Senior Software Engineer, Server-Side Technologies", "description": "<p>The word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.</p>\n<p>We are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.</p>\n<p>Who you are</p>\n<ul>\n<li>You enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks</li>\n<li>You want to be part of a small team inside a large company with massive opportunity for growth</li>\n<li>You enjoy collaboration with other teams including product, biz dev, and our in-house QA team</li>\n<li>You eagerly dig into complex engineering problems</li>\n</ul>\n<p>What we do</p>\n<ul>\n<li>Write scalable back-end and front-end code in JRuby, Java, and JavaScript</li>\n<li>Experiment with new tech to find the right tool for the job</li>\n<li>Maintain high code quality through code reviews and automated tests</li>\n<li>Use Kanban to manage multiple releases per week</li>\n<li>Participate in and improve Dev Ops for our primary revenue generating applications</li>\n</ul>\n<p>How we do it</p>\n<ul>\n<li>Ruby/Rails</li>\n<li>JavaScript (JQuery, AngularJS, Vue.js)</li>\n<li>IntelliJ IDEA / TeamCity</li>\n<li>AWS (EC2, EB, RDS)</li>\n<li>Google Cloud (BiqQuery, Dataflow, Cloud Functions)</li>\n<li>MySQL</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>A highly competitive compensation package</li>\n<li>401k with company match</li>\n<li>Paid vacation, work from home, and sick days</li>\n<li>Annual personal development budget to attend a conference of your choice</li>\n<li>Designated time to work on the company-related projects you feel strongly about</li>\n<li>Macbook Pros, dual monitors, and a quiet working space</li>\n<li>Catered lunch at least once a week</li>\n<li>Monthly company events\n </li>\n</ul>\n<p>Jun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.</p>\n<p>Total compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.</p>", "location": "New York, NY", "company": "Jun Group", "appLink": "<p><a href=\"https://boards.greenhouse.io/jungroup/jobs/4096629002\">https://boards.greenhouse.io/jungroup/jobs/4096629002</a></p>"}}, {"model": "api.job", "pk": 102, "fields": {"title": "Full Stack Engineer", "description": "<p>Full-Stack Engineer</p>\n<p>Bamboo is re-imagining the insurance business and we want you to help us achieve this goal. We are looking for an experienced full-stack developer (4+ years) to work on Bamboo’s cloud-based insurance platform - you will work closely with other developers and industry experts to build and support features for both internal and external users. The development team you will be working with will be highly distributed and you should be comfortable with asynchronous communication.\nBamboo offers full benefits, a positive team-oriented work environment and the opportunity to participate in building a new industry leader in the property insurance space.</p>\n<p>You will</p>\n<ul>\n<li>Write, review, and maintain code primarily in Python and JavaScript</li>\n<li>Build new features for both internal and external users</li>\n<li>Adhere to our high engineering standards</li>\n<li>Work collaboratively with a highly distributed team</li>\n</ul>\n<p>Preferred Qualifications</p>\n<ul>\n<li>Experience (3+ years) with Python (or a similar language like Ruby), JavaScript, and SQL</li>\n<li>Generalist who can work on both the frontend and backend, and can solve problems efficiently and elegantly</li>\n<li>Experience with TDD and other development best practices</li>\n<li>Knowledge of deployments and cloud infrastructure</li>\n<li>Experience using Git and Unix</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Insurance experience is a plus</li>\n</ul>\n<p>Benefits and Compensation</p>\n<ul>\n<li>Based on relevant experience and proven performance</li>\n<li>Comprehensive health insurance coverage including medical, dental, and vision</li>\n<li>Flexible schedule</li>\n<li>Relaxed work environment</li>\n<li>Remote work</li>\n</ul>\n<p>About Bamboo\nAt Bamboo we are building a modern insurance company focused on delivering a superior experience for our customers and business partners through exceptional people and great technology. Founded in 2017 and backed by some of the largest carriers in the industry, our initial product offering includes California Homeowners and Dwelling Fire insurance policies. Our team of industry veterans enjoys working together and takes tremendous pride in our company and our products.</p>\n<p>Bamboo is an Equal Employment Opportunity employer.  \t<a href=\"https://bambooinsurance.com/\">https://bambooinsurance.com/</a></p>", "location": "Remote", "company": "Bamboo Insurance", "appLink": "<p><a href=\"mailto:recruiting@bambooinsurance.com\">recruiting@bambooinsurance.com</a></p>"}}, {"model": "api.job", "pk": 103, "fields": {"title": "Full Stack Developer (Ruby / JS)", "description": "<p>At Planning Center, we build powerful, beautiful applications specifically for churches. Each of our apps has a dedicated team of designers and developers who are committed to refining and expanding their specific app in response to real customer needs. Our customers include 90 of the 100 largest churches in the country, but also small community and neighborhood churches, and we strive to make day-to-day operations easier for all of them.</p>\n<p>We’re a development driven company — over half our staff are either developers or designers who code, and even our founder spends much of his time programming — and we’re seeking another developer with expertise in Ruby on Rails, ES6, and React to help make our software even better.</p>\n<p>Developers at Planning Center are:</p>\n<ul>\n<li>\n<strong>Invested.</strong> We care about the products we create and the people we create them for, and we all contribute to the vision and direction of our apps. Every one of our developers is critical to their team.</li>\n<li>\n<strong>Curious.</strong> We aren’t afraid to ask questions, experiment, and iterate. We also love playing with fun new technologies like Go and Elixir, and we have Free Weeks every few months for exploring projects that spark our interest.</li>\n<li>\n<strong>Humble.</strong> We are always looking for opportunities to grow and learn from one another.</li>\n</ul>\n<p>In your daily life at Planning Center, you could expect to:</p>\n<ul>\n<li>Take ownership of your projects and have a voice in how to best complete them</li>\n<li>Collaborate on Github with your product manager, front-end designer, and fellow app team developers</li>\n<li>Engage in an agile development process (and, depending on your team, get to call your sprints “fun runs”)</li>\n<li>Make coffee eight different ways in our rad coffee bar</li>\n<li>...or, if you’re remote, drink coffee in a hip co-working space that we help pay for</li>\n</ul>\n<p>Do work you’re proud of alongside a team of smart, thoughtful, like-minded developers\nWe believe the strongest teams are made up of people with diverse backgrounds and experiences, and we are committed to cultivating that diversity here at Planning Center. We are ready for the ongoing work that goes into building an inclusive, supportive place for you to do your best work.</p>\n<h3>Requirements</h3>\n<p>2+ years working with Ruby on Rails and JavaScript.\nIf remote, must be willing to travel to the office four times each year to connect in person with the rest of the team.</p>\n<h3>Benefits</h3>\n<p>We love our people and want this to be the best place for them to work. In addition to a competitive salary, we offer:</p>\n<ul>\n<li>Full health, dental, and vision coverage</li>\n<li>Company contribution to a 401(k)</li>\n<li>Mobile phone allowance</li>\n<li>Co-working stipend</li>\n<li>Charitable giving match</li>\n<li>Paid parental leave</li>\n<li>Vacation and paid holidays</li>\n<li>Paid Fridays off in the summer</li>\n<li>Continual education allowance for books, videos, or conferences</li>\n<li>Free weeks every several months to work on a project of your choosing</li>\n</ul>\n<p><strong>Gear</strong>\nThe things you need to get your job done - laptop, monitor, standing desk, chair - all on us!</p>\n<p><strong>Work from Anywhere in the USA</strong></p>\n<p>We are dedicated to hiring the best talent available and will offer the option to work remote for the right person. We fly our remote team into the office once every quarter, so you can enjoy the nice California weather and connect with the rest of the team (60% of which is remote).</p>", "location": "Anywhere in the US", "company": "Planning Center", "appLink": "<p>Visit <a href=\"https://pco.workable.com/\">https://pco.workable.com/</a></p>"}}, {"model": "api.job", "pk": 104, "fields": {"title": "Remote Full Stack ReactJS/Ruby on Rails", "description": "<p>Your job.\nOur Assessments team has a simple mission: help candidates get the right job.  We let people build a profile to demonstrate their knowledge, skills, and abilities using job assessments… we’re trying to make the resume a thing of the past.</p>\n<p>Our team is highly distributed geographically so this position is open to remote candidates anywhere in the US or Canada.</p>\n<p>Our team is nimble and scrappy.  We ship new capabilities often and quickly by explicitly asking ourselves the 80/20 question a.k.a. the Pareto Principle.</p>\n<p>You will:</p>\n<ul>\n<li>Build the core functionality of our assessments platform and own design and execution</li>\n<li>Develop our API and integrations with external applicant tracking systems like Greenhouse and\nJobvite</li>\n<li>Scale to serve 100M+ job seekers</li>\n</ul>\n<p>About you.</p>\n<p>What we are looking for:</p>\n<p>Deep web application development experience for complex apps\nOur stack is ReactJS and Ruby on Rails\nSr Level, 7+ years of recent industry experience\nMust have experience with architecture, scalable systems and conducting code reviews\nMust be proficient in either React or RoR with working knowledge of the other.</p>\n<p>Our hiring process:</p>\n<p>We don’t care very much about your resume or your interviewing/whiteboarding skills. We want to see your code!</p>\n<p>Our interview process:\n15min phone call with a recruiter\n1-hour google hangout, showing off your coding abilities\n2 day paid working project</p>", "location": "Remote", "company": "Indeed", "appLink": "<p><a href=\"https://www.indeed.jobs/career/JobDetailPage?jobId=11686&amp;source=GitHub\">https://www.indeed.jobs/career/JobDetailPage?jobId=11686&amp;source=GitHub</a></p>"}}, {"model": "api.job", "pk": 105, "fields": {"title": "Remote Software Engineer", "description": "<p>Your job.\nOur Assessments team has a simple mission: help candidates get the right job.  We let people build a profile to demonstrate their knowledge, skills, and abilities using job assessments… we’re trying to make the resume a thing of the past.</p>\n<p>Our team is highly distributed geographically so this position is open to remote candidates anywhere in the US, Canada, or Brazil as well as in our offices in Austin and San Francisco.</p>\n<p>Our team is nimble and scrappy.  We ship new capabilities often and quickly by explicitly asking ourselves the 80/20 question a.k.a. the Pareto Principle.</p>\n<p>You will:</p>\n<p>Build the core functionality of our assessments platform and own design and execution\nDevelop our API and integrations with external applicant tracking systems like Greenhouse and Jobvite\nScale to serve 100M+ job seekers</p>\n<p>About you.</p>\n<p>Requirements</p>\n<p>4+ years industry experience in Java, Python or Ruby on Rails\nBS in Computer Science or related area, or relevant work experience\n6+ years industry experience in software development</p>\n<p>We get excited about candidates who:</p>\n<p>Has a passion for performance and scalability\nHas a strong sense of ownership in every application they build\nSignificant experience with large-scale, high-performance systems\nThrives on simplifying complex information\nDeep understanding of software architecture</p>", "location": "Remote", "company": "Indeed", "appLink": "<p><a href=\"https://www.indeed.jobs/career/JobDetailPage?jobId=14049&amp;source=GitHub\">https://www.indeed.jobs/career/JobDetailPage?jobId=14049&amp;source=GitHub</a></p>"}}, {"model": "api.job", "pk": 106, "fields": {"title": "Remote ReactJS/Redux Engineer", "description": "<p>Your job.\nOur Assessments team has a simple mission: help candidates get the right job.  We let people build a profile to demonstrate their knowledge, skills, and abilities using job assessments… we’re trying to make the resume a thing of the past.</p>\n<p>Our team is highly distributed geographically so this position is open to remote candidates anywhere in the US, Canada, or Brazil as well as in our offices in Austin and San Francisco.</p>\n<p>Our team is nimble and scrappy.  We ship new capabilities often and quickly by explicitly asking ourselves the 80/20 question a.k.a. the Pareto Principle.</p>\n<p>You will:</p>\n<p>Build the core functionality of our assessments platform and own design and execution\nDevelop our API and integrations with external applicant tracking systems like Greenhouse and Jobvite\nScale to serve 100M+ job seekers\nAbout you.</p>\n<p>What we are looking for:</p>\n<p>Deep web application development experience for complex apps\nSr Level, 5+ years of recent industry experience\nMust be proficient in either ReactJS/Redux or RoR.\nMust have experience with architecture, scalable systems and conducting code reviews\nOur stack is ReactJS and Ruby on Rails</p>\n<p>Our hiring process:</p>\n<p>We don’t care very much about your resume or your interviewing/whiteboarding skills. We want to see your code!</p>\n<p>Our interview process:\n15min phone call with a recruiter\n1-hour google hangout, showing off your coding abilities\n2 day paid working project</p>", "location": "Remote", "company": "Indeed", "appLink": "<p><a href=\"https://www.indeed.jobs/career/JobDetailPage?jobId=10165&amp;source=GitHub\">https://www.indeed.jobs/career/JobDetailPage?jobId=10165&amp;source=GitHub</a></p>"}}, {"model": "api.job", "pk": 107, "fields": {"title": "Site Reliability Engineer", "description": "<p>As a site reliability engineer at NationBuilder, you'll be part of the team responsible for the overall reliability, availability, security, and performance of our platform. You’ll recommend and implement changes across our systems and environments, evaluate new technologies, be challenged with problems to solve, and contribute to our technological direction.</p>\n<p>NationBuilder creates software for leaders of all kinds - political candidates, nonprofit organizations, anyone building a community of people to make something happen in the world. To learn more about NationBuilder, read about our mission and beliefs.</p>\n<p>We're looking for someone who:\nHas a love of learning.\nThrives in a highly collaborative environment, enjoys the chance to pair with their peers, and gives and receives well crafted feedback.\nProficiency with one or more languages (Ruby, Go, Python).\nWorking familiarity with provisioning, automation, and configuration management solutions (terraform, puppet)\nOperational experience with public cloud environments (AWS, Google Cloud Platform, Azure)\nHave at least five years experience supporting high-volume customer facing services.\nExperience supporting and managing Docker containers from local development to production.\nKnowledge of relational databases (Postgres) and NoSQL systems (MongoDB, Couchbase, Redis).\nExtensive Linux experience and proficiency with the shell (bash, zsh, sed, awk), and networking concepts and protocols (TCP/IP, UDP, HTTP, NTP, DNS, TLS).</p>\n<p>Our stack:\nOur platform is primarily built with Ruby on Rails with some additional Ruby and Go services. Data is stored in PostgreSQL, MongoDB, Couchbase, Redis, and Hadoop. All on a cloud native architecture in AWS and managed with Terraform and Puppet.</p>\n<p>NationBuilder is an equal opportunity employer and we value diversity. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>", "location": "Los Angeles, Remote", "company": "NationBuilder", "appLink": "<p>Please apply on our jobs site: <a href=\"https://hire.withgoogle.com/public/jobs/nationbuildercom/view/P_AAAAAAEAAC8Oi8icy6MaKp?trackingTag=gitHub\">https://hire.withgoogle.com/public/jobs/nationbuildercom/view/P_AAAAAAEAAC8Oi8icy6MaKp?trackingTag=gitHub</a></p>"}}, {"model": "api.job", "pk": 108, "fields": {"title": "Senior Full Stack Web Developer", "description": "<p>About Us</p>\n<p>Boxbot is a well funded startup that builds and operationalizes robotic technology to automate the delivery supply chain. Boxbot significantly reduces delivery costs while increasing convenience, relieving traffic congestion, cutting greenhouse gas emissions and enabling commercial drivers to handle a rapidly growing number of deliveries.</p>\n<p>Responsibilities</p>\n<p>We are looking for full-stack engineers with expertise in Ruby, Rails, PostgreSQL, Redis, Javascript (React, React Native). As a company, we value growth and learning, and want someone to contribute to building a fantastic customer facing product that will revolutionize last-mile logistics!</p>\n<p>As an integral member of our software engineering team, you will be responsible for building out the key backend systems that will be interfacing both with our robots and our customers. We care deeply about the customer experience, and build products that solve problems using beautiful design and high quality code.</p>\n<p>Requirements</p>\n<ul>\n<li>5+ years designing, building and deploying web applications</li>\n<li>Must have experience with Ruby on Rails (we are on version 5.2)</li>\n<li>Experience with REST API design principles (interest in GraphQL)</li>\n<li>Understanding of front-end technologies, such as JavaScript, HTML5, and CSS3. Experience with React is a plus.</li>\n<li>Expertise in relational databases and schema design</li>\n<li>Deep understanding of Web Concepts</li>\n<li>Self-starter with experience working in small and dynamic teams</li>\n<li>An eye for good design and beautiful code</li>\n<li>Passion for scale &amp; performance and experience w/ distributed systems</li>\n<li>BS in Computer Science or equivalent</li>\n</ul>\n<p>Why work here?\nAutonomy, mastery, purpose: We provide a clear mission so that you can self-direct your work, provide exceptional challenges to hone your skills, and help transform a supply chain that impacts the lives of millions of people. You get one of the early seats on a fast moving startup and you get to work with robots!</p>\n<p>Benefits include medical, dental, vision, life, commuter, snacks, 401(k), etc.! We are located in Jack London Square with an easy Commute via BART, Ferry, Amtrak and free parking!</p>", "location": "Oakland, California", "company": "Boxbot", "appLink": "<p><a href=\"https://jobs.lever.co/boxbot/d5d5893d-2332-4bc1-b44d-ea7ea7a93198?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/boxbot/d5d5893d-2332-4bc1-b44d-ea7ea7a93198?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>"}}, {"model": "api.job", "pk": 109, "fields": {"title": "Solutions Architect - IoT/Python/React (US/Canada)", "description": "<p><strong>Job Description</strong></p>\n<p>Analytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Solutions Architect to help us scale our execution to support additional new high-tech sectors.</p>\n<p>Analytics Fire is a deeply technical engineering organization. Most of us are software engineers and spend the majority of our time on heads down engineering activities like coding. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the personality and the technical skill set to collaborate directly with clients and senior members of the technical team in order to help steer technical decision making and requirements gathering, especially early in the project lifecycle.</p>\n<p>This position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.</p>\n<p>As a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background. However, it is a hard requirement that you are able to support the following 3 types of responsibilities:</p>\n<ul>\n<li>(a) Represent Analytics Fire software engineering teams in client-facing interactions (and sometimes interactions with potential clients)</li>\n<li>(b) Technical writing responsibilities such as documenting requirements, project plans, system architecture, etc.</li>\n<li>(c) Making meaningful contributions to the execution of complex software projects.</li>\n</ul>\n<p>For reference, here is a list of some technologies we are currently actively using on a day-to-day basis:</p>\n<ul>\n<li>Front-end: JavaScript / React / Angular</li>\n<li>Back-end: Ruby / Python / Node.js</li>\n<li>Embedded: Embedded Linux, Yocto, C, MQTT</li>\n<li>CV: OpenCV, PCL, object identification and tracking</li>\n<li>ML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms</li>\n<li>Modern software techniques: RESTful APIs, SOA, PaaS, etc</li>\n<li>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</li>\n<li>Other technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit</li>\n</ul>\n<p>Your primary responsibility will be to assist in guiding new projects through sales, planning, development, and deployment. This will be accomplished through a combination of client interactions, technical writing, and participation in formal sales, program management, and engineering related processes. Your contributions will naturally be slightly front-loaded towards the sales and planning phases, however you will remain deeply connected to each project through the entire lifecycle in order to ensure conceptual integrity is maintained from design to final implementation.</p>\n<p>This is a remote position but is only open to candidates living in the US or Canada. We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.</p>\n<p><strong>Skills &amp; Requirements</strong></p>\n<p>“Must have” requirements:</p>\n<ul>\n<li>5+ years relevant hands-on experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.</li>\n<li>Fluency around current modern best practices around software development, data engineering, and DevOps.</li>\n<li>Soft skills necessary to navigate and negotiate with multiple teams, both internal and external to Analytics Fire.</li>\n<li>Ability and willingness to familiarize yourself with our technical stack.</li>\n<li>Superior organization and detail orientation.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Willingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.</li>\n</ul>\n<p>“Nice to have” requirements:</p>\n<ul>\n<li>Former work experience or training as a technical Program Management.</li>\n<li>Deep technical experience with C, Python, or ReactJS</li>\n</ul>\n<p><strong>About Analytics Fire</strong></p>\n<p>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</p>\n<p>“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</p>", "location": "North America", "company": "Analytics Fire", "appLink": "<p>Email your resume to <a href=\"mailto:join-us@analyticsfire.com\">join-us@analyticsfire.com</a></p>"}}, {"model": "api.job", "pk": 110, "fields": {"title": "Release Manager - IoT/Python/React (US/Canada)", "description": "<p><strong>Job Description</strong></p>\n<p>Analytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Release Manager to help us scale our execution to support additional new high-tech sectors.</p>\n<p>Analytics Fire is a deeply technical engineering organization. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the technical skillset and the personality to maintain highly coordinated relationships with key internal and client-side stakeholders in order to help proactively guide projects through planning, development, deployment, release, and DevOps.</p>\n<p>This position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.</p>\n<p>As a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background and skill set    . However, ability to support client-facing interactions (clarifying requirements, negotiating technical approaches, reporting on status, etc) as well as make meaningful internal contributions in a highly technical environment is a hard requirement.</p>\n<p>For reference, here is a list of some technologies we are currently actively using on a day-to-day basis:</p>\n<ul>\n<li>Front-end: JavaScript / React / Angular</li>\n<li>Back-end: Ruby / Python / Node.js</li>\n<li>Embedded: Embedded Linux, Yocto, C, MQTT</li>\n<li>CV: OpenCV, PCL, object identification and tracking</li>\n<li>ML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms</li>\n<li>Modern software techniques: RESTful APIs, SOA, PaaS, etc</li>\n<li>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</li>\n<li>Other technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit</li>\n</ul>\n<p>Description of responsibilities:</p>\n<ul>\n<li>Develop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.</li>\n<li>Participate in collaborative planning discussions and technical decision making early in the project lifecycle to ensure that key decisions are made with reliability, testability, and maintenance in mind.</li>\n<li>Monitor and oversee coordination, integration, flow of development, testing, and deployment around multiple parallel projects and threads of engineering execution.</li>\n<li>Drive planning and delivery of high quality software releases: Manage change control process during releases, Continuously improve company release processes, Proactively identify and mitigate risks and remove obstacles to releases</li>\n<li>Personally plan and lead the team through our most important software releases. Advise and support the team so that they can take on less critical releases on a day-to-day basis.</li>\n<li>Continually integrate the QA team and testing engineers into both the requirements gathering and software development processes and report status to clients on a very frequent basis.</li>\n</ul>\n<p>This is a remote position but is only open to candidates living in the US or Canada. (Note: we may be open to US or Canadian citizens living abroad in US-overlapping time zones on a case by case basis.) We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.</p>\n<p><strong>Skills &amp; Requirements</strong></p>\n<p>“Must have” requirements:</p>\n<ul>\n<li>Soft skills necessary to develop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.</li>\n<li>3+ years hands experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.</li>\n<li>Familiarity with current modern best practices around software development, data engineering, and DevOps</li>\n<li>Ability and willingness to familiarize yourself with the specific technical stacks that we use.</li>\n<li>Superior organization and detail orientation.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Willingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.</li>\n</ul>\n<p>“Nice to have” requirements:</p>\n<ul>\n<li>Hands-on technical experience writing code in C, C++, Python, ReactJS</li>\n<li>Previous experience as a technical Program Manager.</li>\n</ul>\n<p><strong>About Analytics Fire</strong></p>\n<p>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</p>\n<p>“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</p>", "location": "North America", "company": "Analytics Fire", "appLink": "<p>Email your resume to <a href=\"mailto:join-us@analyticsfire.com\">join-us@analyticsfire.com</a></p>"}}, {"model": "api.job", "pk": 111, "fields": {"title": "Sr PHP Developer (Full-stack)", "description": "<p>Requirements:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nice to Haves:</p>\n\n\n\n\n\n\n\n\n<p>About the Role: </p>\n<p>You will be responsible for contributing to the technical design, development, and implementation of the SunteckTTS application ecosystem. The role involves more than just writing production code; in a typical week, you could be: brainstorming technical architecture options, providing feedback to improve our development processes, reviewing PRs from other team members, fixing a bug you randomly came across, or improving unit test coverage.</p>\n<p>We’re looking for an outstanding Senior Developer with a desire to participate in a growing team with the skills, experience, and understanding to join a small, but strong development team. In order to meet the many challenges and high volume work of the SunteckTTS users, it is important for the Senior Developer to have excellent communication.</p>\n<p>About SunteckTTS and the Team:</p>\n<p>SunteckTTS is an industry-leading, full-service, transportation logistics provider that operates through a network of sales, operations, and capacity specialists. We are a billion dollar company with over 200 independently owned and operated agent offices across the U.S. and Canada.\nWe focus on providing asset and non-asset surface transportation to a wide range of end-use markets, including food, lumber, paper, printing, textiles, electronics, machinery, government, and more. The Application Development Group is in the midst of an ambitious program to create best in breed software products and improve existing systems for our user base. Our team of Business Analysts and Developers share a culture of self-ownership and open communication to provide\nmaximum business value. We strive to ensure team-based component ownership, development, and quality assurance. We are a tight knit group that relies on ability and flexibility to ensure we balance our strides towards improved process and need to meet the priorities of a heavily used\nenterprise system. The Application Development Group focuses on a culture of open communication, learning, and transparency.</p>\n<p>SunteckTTS is an Equal Opportunity Employer and does not discriminate against qualified applicants with regard to race, color, religion, age, sex, national origin, handicap, sexual orientation or veteran status.</p>", "location": "Jacksonville, FL (Or Remote)", "company": "SunteckTTS", "appLink": "<p>Email your resume to:\n<a href=\"mailto:anthony.vargas@suntecktts.com\">anthony.vargas@suntecktts.com</a></p>"}}, {"model": "api.job", "pk": 112, "fields": {"title": "Senior full-stack software engineer - JS + Ruby", "description": "<p>We created Sticker Mule to be the best place to work and shop. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work.</p>\n<p>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation.</p>\n<p><a href=\"https://www.stickermule.com/about\">Watch a brief video to learn more</a></p>\n<p><strong>Why we enjoy working here</strong></p>\n<ol>\n<li>We work flexible hours with an asynchronous culture. </li>\n<li>We work at a sustainable pace without unreasonable external deadlines.</li>\n<li>Varied, interesting technical challenges to work on.</li>\n<li>Opportunities to make a large impact as part of a small, highly motivated team.</li>\n</ol>\n<p><strong>Our tech stack</strong></p>\n<ol>\n<li>Backend: Ruby on Rails, NodeJS, Go</li>\n<li>DB: Postgres, MySQL, Redis</li>\n<li>Frontend:  React, Redux, Webpack</li>\n<li>APIS: GraphQL, GRPC, GCloud PubSub</li>\n<li>Google Cloud Platform</li>\n<li>Docker, Kubernetes</li>\n</ol>\n<p><strong>What you will do</strong></p>\n<ol>\n<li>Design, build, test, deploy and maintain web applications and services</li>\n<li>Write clean, performant code in accordance with our team’s code style guidelines</li>\n<li>Work to improve and maintain the code health of all our software</li>\n<li>Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way</li>\n<li>Participate in peer code reviews, share expertise with other members of the team, mentor junior developers</li>\n</ol>\n<p><strong>About you</strong></p>\n<ol>\n<li>You have a minimum of 3 years professional software development experience</li>\n<li>You’re highly competent in JavaScript and have some experience with Ruby</li>\n<li>You have experience building single page applications, ideally with React</li>\n<li>You possess strong analytical and critical thinking skills</li>\n<li>You have great written and verbal communication skills in English</li>\n</ol>\n<p><strong>Requirements</strong></p>\n<ol>\n<li>Applicants will be sent a Hackerrank test within 1-3 days of applying.</li>\n<li>Test must be completed within 5 days.</li>\n</ol>\n<p><strong>Compensation</strong></p>\n<ol>\n<li>$90,000-$115,000+ depending on experience</li>\n<li>Signing bonus</li>\n<li>28 days vacation</li>\n</ol>", "location": "Remote", "company": "Sticker Mule", "appLink": "<p><strong>Apply here only:</strong>  <a href=\"https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf\">https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf</a></p>"}}, {"model": "api.job", "pk": 113, "fields": {"title": "DevOps (Remote - Europe)", "description": "<p>Dear server/database admin, you’ve arrived at the opening where challenge meets excitement. Piktochart is a growing startup and we work to serve our users so that they can create infographics on a daily basis with ease. If you have a strong passion for scaling web apps and application security, we need your help on our server operations!</p>\n<p>Your mission:</p>\n<p>Design scalable and secure web infrastructure on GCP &amp; AWS clouds\nMonitor system and network health\nDeploy containerized applications on Kubernetes\nAnalyze software performance and perform system/code optimization\nDesign and scale database systems\nAutomate server management using tools like Ansible or Saltstack\nParticipate in service capacity planning and demand forecasting</p>\n<p>You offer :</p>\n<p>3+ years experience with distributed Unix/Linux environments, preferably Ubuntu or Debian\nFamiliarity with Amazon and Google clouds\nExperience with Docker and container orchestration platforms\nExperience with scaling MySQL, PostgreSQL, Redis and Memcached clusters\nFamiliar with Ruby on Rails web framework\nStrong knowledge of web application security\nBash and Python scripting\nKnowledge of Nginx, HAProxy\nKnowledge of Ansible / Chef / Puppet\nKnowledge of Elasticsearch stack</p>\n<p>Extra points if you have:</p>\n<p>Experience with CI services, CircleCI / Jenkins\nExperience with Golang, Nodejs\nExperience with Agile practices (Scrum, Kanban)\nKnowledge of Nagios / Statd / Graphite\nHigh self-learning ability to adapt to emergency circumstances\nAbility to manage multiple issues at once and keep your team updated on what's going on\nKnowledge in backup/restore operations</p>\n<p>Location :</p>\n<p>Remote (Already based in Europe or willing to work in EU timezone)</p>", "location": "Europe", "company": "Piktochart Sdn Bhd", "appLink": "<p>Apply here : <a href=\"https://grnh.se/e0769a2c1\">https://grnh.se/e0769a2c1</a></p>"}}, {"model": "api.job", "pk": 114, "fields": {"title": "Senior Software Engineer - Ruby on Rails / React", "description": "<p><strong>Remote position for Vancouver, BC residents</strong></p>\n<p><a href=\"http://ikayzo.com\">Ikayzo</a>, a boutique software development firm based in Honolulu, is looking for experienced Ruby on Rails developers with strong React skills capable of taking complex projects from ideation to release. In this role he / she will be responsible for building high quality, secure and scalable web applications in the finance / fintech space. Our customers include industry leading software firms, renewable energy companies and financial institutions.</p>\n<p>Please provide your GitHub profile or another work example reference in your resume.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>A solid grounding in OO software architecture / design patterns</li>\n<li>A pragmatic approach focused on delivering on-time while maintaining quality</li>\n<li>Experience designing and implementing successful non-trivial enterprise Ruby on Rails projects (5+ years)</li>\n<li>Experience with ReactJS (Reflux or Redux)</li>\n<li>Experience with agile development methodologies</li>\n<li>Comfort with Git Feature Branch Workflow and the ability to incorporate PR feedback quickly</li>\n<li>Firm grasp of data modeling</li>\n<li>A passion for software development</li>\n</ul>\n<p><em>Note: Specialized finance domain knowledge is not required but successful applicants must be able to quickly understand complex business rules and calculations.</em></p>\n<p>We are not accepting applications from recruiters for this position.</p>", "location": "Vancouver (remote)", "company": "Ikayzo", "appLink": "<p>Send resumes to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a></p>"}}, {"model": "api.job", "pk": 115, "fields": {"title": "Full Stack Developer & Senior Analyst (Investment Analytics)", "description": "<p>Position Overview:\nWe are seeking an experienced Software Engineer to help us design and build Acadian’s advanced browser-based, interactive, analytical platform that helps us better understand, explain, and improve our quantitative investment process. This is a hands-on, full-stack development role that provides growth and learning opportunities. The Software Engineer will utilize and hone a variety of technical skills while gaining and applying quantitative investment knowledge. Our small team is embedded within the investment group, providing the opportunity to see your work in action. Join us to leverage your software development skills and work with world class technology and investment experts.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Design, build, test, and support multi-tiered distributed, clustered, web-based applications and platforms</li>\n<li>Engineer, design, and build scalable, interactive, responsive, informative, and beautiful data visualization and exploration tools</li>\n<li>Team up with quantitative portfolio managers and researchers to develop and execute process improvement initiatives through software development</li>\n</ul>\n<p>Qualifications:</p>\n<ul>\n<li>Experience building browser-based applications using JavaScript, CSS, and HTML</li>\n<li>Experience programming using a server-side scripting language such as Python (Node, Ruby, Julia, etc.)</li>\n<li>Degree in Computer Science or equivalent knowledge and technical work experience</li>\n<li>Hands on experience running http server such as Apache / NGINX</li>\n<li>Prior investment/financial industry knowledge is not required</li>\n</ul>\n<p>Other technologies we use:</p>\n<ul>\n<li>SQL, NoSQL, MongoDB, Redis</li>\n<li>Numpy, Scipy, Pandas</li>\n<li>D3, AngularJS, Node</li>\n<li>Docker, Slurm, ZeroMQ, AWS</li>\n</ul>\n<p>It is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.</p>", "location": "Boston, MA", "company": "Acadian Asset Management", "appLink": "<p><a href=\"https://www.acadian-asset.com/careers\">https://www.acadian-asset.com/careers</a></p>"}}, {"model": "api.job", "pk": 116, "fields": {"title": "Media Software Engineer", "description": "<p>Responsibilities :</p>\n<p>Coding at the component level and works under minimal supervision.\nAsset Management System Administration with systems, applications and service integrations.\nProvide proactive, regular, and professional-level communication with clients and team members alike\nManage system integration with 3rd party providers.\nProvide usage reports and track key metrics as required.\nEnsure delivered solutions enable the organization to manage the asset portfolio with respect to risk, cost, control, governance, compliance and business performance objectives\nCollaborate with stakeholders, developers, and system teams to design and maintain automation and deployment tools\nAssist project and technology teams in troubleshooting systems\nCreate dashboards and other tools for Project, Operations and Engineering teams to use in day-to-day monitoring and troubleshooting and enhance operational transparency within business units\nFollow Security Best Practices\nOccasional after hour support based on upgrades, new deployments and high-profile campaigns and/or market critical events.</p>\n<p>Job Requirements</p>\n<p>Knowledge/experience in relevant technologies, such as:\nXML Scripting\nJava/JavaScript\nJSON Messaging\nHTTP Protocol\nWeb Services (SOAP &amp; REST)\nPython, Ruby, Perl, and Smalltalk or other scripting languages preferred\nFamiliarity with ELK Stack (Prometheus) preferred\nAmazon Web Services technologies experience preferred\nAsset Management Systems\nSolid interpersonal skills with the ability to communicate and present to all levels of the organization and with external parties\nSelf-directed, highly motivated individual who can effectively manage multiple activities, pay attention to detail and a focus on continuous improvement.\nHigh degree of professionalism</p>\n<p>Desired Characteristics</p>\n<p>Scope of activities within projects include:\nBusiness requirements, documentation &amp; gap analysis\nCoordination of connectivity setup\nTechnical implementation/provisioning\nDevelop test plans, procedures and scripting for new workflows, integration and automated UI testing\nUnderstand Process flow and data mapping\nData preparation, deployment and analysis\nWeb services development\nApplication knowledge: Orchestration tools, Workflow Engines, Search Engines, BPM and transcoding.\nDatabase experience and network administration</p>", "location": "Universal City, CA", "company": "NBCUniversal", "appLink": "<p>If interested, please apply here: <a href=\"https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354&amp;siteid=5108&amp;areq=43037BR\">https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354&amp;siteid=5108&amp;areq=43037BR</a></p>"}}, {"model": "api.job", "pk": 117, "fields": {"title": "Backend Developer Ruby/Elixir", "description": "<p>You are looking to put your skills to use in a fast-moving product used by thousands of people every day? <strong>You care about maintainable, tested, well-documented code, consistency and technical excellence, while always putting the user’s needs first?</strong></p>\n<p>We’re looking for a developer focused on backend who is excited to work within an <strong>international and welcoming team</strong> of backend developers, frontend developers, and support engineers to build and maintain a fast and robust codebase for Cobot.</p>\n<p><strong>Cobot is a management platform for coworking spaces. Our app helps coworking spaces around the world to automate their operations so that they can focus on what matters most: building communities and welcoming workspaces.</strong> Coworking spaces from New Delhi to San Francisco use us to manage their members, collect payments, book conference rooms, and more. Our customers range from small creative spaces with only a few members to huge business accelerators with thousands of people. We’re a bootstrapped company, operating since 2006 out of Berlin Kreuzberg. We’re a team of 15 people, meaning lots of opportunity for you to actively shape the product, and contribute to the success of the team in a very direct way.</p>\n<p>Our technology stack is evolving all the time. Our backend is 90% Ruby/Rails, and we recently started to use Elixir. Our frontend is server generated HTML or Ember.JS. As databases, we use CouchDB, Postgres, DynamoDB. We deploy to AWS and Heroku.</p>\n<p>Our team values working at a healthy pace and a normal working day over working long hours late into the night. We foster a culture of continuous improvement and learning. Making mistakes is part of what we do, and we make sure we have each other’s backs and learn from them.</p>\n<p>We value diversity in all aspects of our team. We value everyone’s questions, insights and feedback.</p>\n<p>This is a permanent, employed full-time position in Berlin.</p>\n<p><a href=\"https://cobot.workable.com/j/CE9189A9C9\">Read on</a></p>", "location": "Berlin, Germany", "company": "Cobot", "appLink": "<p><a href=\"https://cobot.workable.com/j/CE9189A9C9\">Apply here</a></p>"}}, {"model": "api.job", "pk": 118, "fields": {"title": "DevOps Engineer", "description": "<p>You are a DevOps or System Engineer who can’t wait to be part of a growing team and to make actual impact. At VONQ we do cool stuff, like building a flagship product, tools and APIs that serve global customers. Are you ready to get your hands dirty in the design, implementation and testing of various infrastructure services that are used by our development teams? Apply at VONQ for DevOps Engineer in Rotterdam!</p>\n<p>DevOps Engineer\nRotterdam, fulltime, ASAP</p>\n<p>Be part of our journey and bring our development process, infrastructure and engineering practices to the next level\nAs our System Engineer you will be the one leading critical platform development efforts. What you’ll actually be contributing to? Our core product, the Job Marketing Platform (JMP). It’s a data-driven application with a recommendation engine that is advising recruiters how they should reach their target audience online.</p>\n<p>We have an ambitious roadmap for the upcoming period. Your part in the process? We will start to utilise a number of various DevOps practices - and that’s where you come in!</p>\n<p>You will be part of an international and experienced Engineering department consisting of Backend and Frontend Developers, Data Engineers, an Agile Coach and a CTO.</p>\n<p>Your day-to-day job in a nutshell as VONQ’s DevOps Engineer</p>\n<ul>\n<li>Make fully functional environments available on demand for the development team\nProvide guidance and support on application architecture as we move to a container based architecture</li>\n<li>Ensure a smooth flow of work for all of our development teams</li>\n<li>Enable fast clear feedback for our development team (and the wider business) on application changes, by providing clear logging, metrics and supporting the team's automated testing infrastructure</li>\n<li>You'll work autonomously to make our architectural and business goals a reality</li>\n</ul>\n<p>Great understanding of DevOps practices and an Agile mindset, that is you!\nThis describes the ideal candidate, but above all we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore we think you need:</p>\n<ul>\n<li>3+ years relevant experience</li>\n<li>Excellent communication skills in English</li>\n<li>Experience working in application development, systems or IT operations</li>\n<li>Experience with Cloud and container technologies (e.g. AWS, docker, rocket)</li>\n<li>Great understanding DevOps practices and why to use them (e.g. CI,CD, Infrastructure as code, automated testing)</li>\n<li>You can develop an array of tools using various programming languages (e.g. Golang, Python, PHP, Scala)</li>\n<li>Experience with at least some of our middleware and databases: NGINX, Elasticsearch, RabbitMQ, MySQL, Mongo</li>\n<li>Experience in contributing to the systems architecture of a company</li>\n<li>Last but not least, you are not afraid to get your hands dirty on older infrastructure, to maintain it and migrate it to the new environment.</li>\n</ul>\n<p>Bonus points!</p>\n<ul>\n<li>Experience with application development (e.g. PHP, Scala, Ruby, Golang)</li>\n<li>Experience with data engineering (e.g. spark, scala, databricks)</li>\n<li>Worked as part of a distributed (or international) team</li>\n</ul>\n<p>This is why you should join our team\nWe promise that at VONQ you’ll never stop learning! You’ll be surrounded by international and experienced colleagues, so prepare yourself for some interesting and intellectual conversations.\nOur product has still a lot of potential to grow, and YOU can make impact on that. You’ll get freedom and space for own initiatives, in fact, we encourage you!</p>\n<p>We have legendary company outing, beers on Friday and lots of FUN!</p>\n<p>There is more! We offer:</p>\n<ul>\n<li>A good salary and 8% holiday allowance</li>\n<li>100% commuting expenses compensation</li>\n<li>Pension contribution</li>\n<li>Flexible working hours</li>\n<li>Unlimited (paid!) holidays</li>\n<li>Time and budget for training</li>\n<li>Relocation support, and more!</li>\n</ul>\n<p>Up for the challenge? Join VONQ as System Engineer and make things happen! Please apply by using this application link\n. Questions? Contact Sarah (Recruiter) -&gt; sarahellithy(at)vonq.com.</p>", "location": "Rotterdam", "company": "VONQ", "appLink": "<p>Please apply by using this application link</p>"}}, {"model": "api.job", "pk": 119, "fields": {"title": "Technology Solutions Developer", "description": "<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>", "location": "New York, New York 10001", "company": "New York University", "appLink": "<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>"}}, {"model": "api.job", "pk": 120, "fields": {"title": "Research Software Engineer", "description": "<p><strong>Research Software Engineer</strong></p>\n<p>Are you passionate about open source and making user friendly client-side web applications? We’re a small team comprised of five developers (six, if you join us!) and a biologist, looking for a developer to help us create client-side applications for the open source <a href=\"http://www.intermine.org\">InterMine</a> data warehouse platform. Using JavaScript and ClojureScript, the successful applicant will create tools to query and display complex biological data.</p>\n<p>We have a lot of fun problems to solve, using the best technologies. How do you let naive users search complex biological data sets? How do you visualise data to let people absorb complicated relationships quickly? How can we use technology to get scientists the answers and data they need? We’re deeply committed to open source and the open science movement. We’re passionate about standards and making scientific data available to everyone.</p>\n<p><strong>Our Stack</strong></p>\n<p>InterMine​ is an open source Java-based data warehouse, integrating biological data in varied formats into a PostgreSQL database. InterMine also includes ​ web services with client libraries​ in R, Python, Perl, Ruby, Java, and JavaScript, and a legacy JSP-based UI. We’ve also developed ​ BlueGenes​ -- our new user interface powered by Clojure. See our current projects on ​<a href=\"https://github.com/intermine/\">GitHub​</a>.</p>\n<p><strong>About You</strong></p>\n<p>We’re looking for an enthusiastic problem solver willing to learn and try new technologies. You’ll be able to show us beautiful interfaces you’ve made. You’ll be comfortable with HTML, CSS, Javascript, and working with the DOM. Note that previous experience with Clojure and / or biology is not required. However an interest and willingness to learn is!</p>\n<p>Please see the <a href=\"http://www.jobs.cam.ac.uk/job/19504/\">job advert</a> for specific details.</p>\n<p><strong>What We Offer</strong></p>\n<p>As a member of a small team, you’ll have the chance to learn and extend your skills significantly. Opportunities include:</p>\n<ul>\n<li>interacting with a ​ worldwide community of open-source contributors​ .</li>\n<li>mentoring students through programs such as ​ Google Summer of Code​ .</li>\n<li>user testing your applications, both in person and via video conferencing.</li>\n<li>presenting/co-authoring academic papers, posters, and talks at technical and\nacademic conferences.</li>\n</ul>\n<p>We offer very competitive salaries and a generous benefits package (see\n<a href=\"http://www.jobs.cam.ac.uk/offer%E2%80%8B\">http://www.jobs.cam.ac.uk/offer​</a> for the full list).</p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>33 days annual holiday</li>\n<li>37.5 hour work week</li>\n<li>University pension</li>\n<li>Child care and bike to work salary sacrifice schemes</li>\n<li>Access to ​ University sports facilities</li>\n<li>Family friendly benefits​ like maternity, paternity and parental leave, flexible\nworking and career break schemes.</li>\n</ul>\n<p>To apply: <a href=\"http://www.jobs.cam.ac.uk/job/19504/\">http://www.jobs.cam.ac.uk/job/19504/</a></p>", "location": "Cambridge, UK", "company": "University of Cambridge", "appLink": "<p>To apply: <a href=\"http://www.jobs.cam.ac.uk/job/19504/\">http://www.jobs.cam.ac.uk/job/19504/</a></p>"}}, {"model": "api.job", "pk": 121, "fields": {"title": "Senior Ruby Developer - Remote", "description": "<p><strong>The Role</strong>\nWe’re looking for a senior backend ruby developer to join our growing experienced and talented technology team. The development team is responsible for all the vital backend infrastructure for our web application, <a href=\"https://www.gatekeeperhq.com/\">Gatekeeper</a></p>\n<p>We develop in Ruby on Rails, so having demonstrable senior experiences of this is essential. You should be capable of working on all aspects of the software development cycle from architecture, coding and testing through to deployment.</p>\n<p><strong>Development team</strong></p>\n<ul>\n<li>We're a distributed team of experienced developers</li>\n<li>We love Ruby</li>\n<li>We know how to cook a Rails monolith in the right way</li>\n<li>We do care about the project, about the code quality and about our customers</li>\n<li>We use code reviews (reviewing each other)</li>\n<li>We have Code to Test Ratio: 1:1.1</li>\n</ul>\n<p><strong>REQUIREMENTS</strong></p>\n<p>Required skills:</p>\n<ul>\n<li>Loves Ruby</li>\n<li>Strong Rails knowledge, a good understanding of reliable design for big Rails projects</li>\n<li>Confident with SQL (PostgreSQL in particular)</li>\n<li>Clean code with an understanding of code smells and refactoring</li>\n<li>Test-driven development - “Test Obsessed”</li>\n<li>Understanding of front-end development (HTML/HAML/SASS/JS). However, no knowledge of frameworks required.</li>\n<li>Experience of delivering large development projects</li>\n<li>Tangible contribution to the open-source community or trackable record of public talks</li>\n</ul>\n<p><strong>We need a talent who wants to be a long-term part of our business — not just an employee!</strong></p>\n<p><strong>BENEFITS</strong></p>\n<ul>\n<li>Salary dependent on experience (range $4,000 - $6,500)</li>\n<li>Work from home</li>\n<li>Flexible working hours</li>\n<li>4 weeks paid leave</li>\n<li>We’ll pay for you to take any relevant training that improves your value to Gatekeeper</li>\n</ul>\n<p><strong>$2000 REFERRAL</strong></p>\n<p>Do you know someone that would be eligible for this role? We are offering a $2000 referral reward if you introduce a suitable candidate that we decide to hire.</p>", "location": "Remote", "company": "Gatekeeper", "appLink": "<p>Send CODE EXAMPLES and your CV to Mihaela Radu at <a href=\"mailto:mihaela.r@gatekeeperhq.com\">mihaela.r@gatekeeperhq.com</a> or apply directly here: <a href=\"https://gatekeeper.workable.com/jobs/810060\">https://gatekeeper.workable.com/jobs/810060</a></p>"}}, {"model": "api.job", "pk": 122, "fields": {"title": "Software Engineer, Full Stack (Rails, React)", "description": "<p><strong>Company Description</strong></p>\n<p>Cortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).</p>\n<p><strong>Job Description</strong></p>\n<p>At Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Creating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.</li>\n<li>Integrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.</li>\n<li>Working closely with our Customer Success team to support client onboarding and operations.</li>\n<li>Taking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.</li>\n<li>Strong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.</li>\n<li>Experience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.</li>\n<li>Product-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.</li>\n<li>Excellent verbal and written communication skills.  Committed, hard-working, and thoughtful.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.</li>\n<li>Unlimited paid time off.</li>\n<li>Your choice of 13” or 15” Macbook Pro.</li>\n<li>Work in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.</li>\n</ul>", "location": "New York, NY", "company": "Cortex Building Intelligence", "appLink": "<p>Schedule a time to chat with our CTO, Justin Spradlin: <a href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\">https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto</a></p>"}}, {"model": "api.job", "pk": 123, "fields": {"title": "Jr SRE", "description": "<p>We created Sticker Mule to be the best place to work and shop. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work.</p>\n<p>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation.</p>\n<p><a href=\"https://www.stickermule.com/about\">Watch a brief video to learn more</a></p>\n<p><strong>Why we enjoy working here</strong></p>\n<ol>\n<li>We work flexible hours with an asynchronous culture. </li>\n<li>We work at a sustainable pace without unreasonable external deadlines.</li>\n<li>Varied, interesting technical challenges to work on.</li>\n<li>Opportunities to make a large impact as part of a small, highly motivated team.</li>\n</ol>\n<p><strong>What you will do</strong></p>\n<ol>\n<li>Help design, build and maintain tools to develop, test and deploy services efficiently. </li>\n<li>Help improving the performance, reliability and security of the Sticker Mule cloud infrastructure. </li>\n<li>Learn how to implement CI/CD pipelines and debug production services. </li>\n</ol>\n<p><strong>About you</strong></p>\n<ol>\n<li>You have interest in knowing not only how to write software, but also how to run it at scale. </li>\n<li>You have a minimum of 1 year of professional software development experience. </li>\n<li>You’re competent in one general purpose language, like Go, Ruby, or JavaScript. </li>\n<li>You like Linux, the command line and bash scripts. </li>\n<li>You have basic experience with one of AWS or Google Cloud. </li>\n<li>You used logging, monitoring and distributed tracing systems. </li>\n<li>You possess strong analytical and critical thinking skills. </li>\n<li>You have great written and verbal communication skills in English. </li>\n</ol>\n<p><strong>Requirements</strong> </p>\n<ol>\n<li>Applicants will be sent a Hackerrank test within 1-3 days of applying </li>\n<li>Test must be completed within 5 days. </li>\n</ol>\n<p><strong>Compensation</strong> </p>\n<ol>\n<li>$72,000-$82,000+ depending on experience </li>\n<li>Signing bonus </li>\n<li>28 days vacation </li>\n</ol>", "location": "Remote", "company": "Sticker Mule", "appLink": "<p><strong>Apply here only:</strong> <a href=\"https://www.stickermule.com/career/007f344b-c4ac-497a-846b-04ae71677ef3\">https://www.stickermule.com/career/007f344b-c4ac-497a-846b-04ae71677ef3</a></p>"}}, {"model": "api.job", "pk": 124, "fields": {"title": "Experienced Backend Engineer - Java/React", "description": "<p><a href=\"https://citrusbyte.com\">Citrusbyte</a> is a software consultancy that believes in using simple tools to solve problems. We build custom systems for both startups and enterprises - You can see our <a href=\"https://citrusbyte.com/portfolio\">portfolio</a> for more information about our clients.</p>\n<p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p>\n<p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p>\n<p>This role will be writing <strong>Java backend code running on serverless architectures</strong>, so experience in this environment is required.  In addition, experience with front-end JS frameworks such as <strong>ReactJS</strong> is a solid plus.</p>\n<p>Beyond that, we are looking for polyglot engineers who have a hunger for learning new languages and tools. We also have open positions for C# engineers. At Citrusbyte, learning new languages and technology, in general, is part of the job, and you should always be able to answer the question: \"what have I learned this week?\"</p>\n<p>We believe that less is more and we vehemently value simplicity. This is reflected in the tools we choose to work with. For this reason, we tend to avoid using big frameworks like Spring/Struts, and instead lean towards smaller, more focused tools.</p>\n<p>We have also done projects in Ruby, Elixir, Node.js, Go, Python, Lua, etc. We strive to learn new tools and languages every day. We believe in always choosing the right tool for the job and we are very open-minded about trying different technologies.</p>\n<p><strong>Skills &amp; Requirements:</strong></p>\n<ul>\n<li>Smart, gets things done</li>\n<li>Excellent communication skills</li>\n<li>Consulting experience</li>\n<li>Passionate about software development</li>\n<li>Experience working in a highly distributed company</li>\n<li>Open minded and always learning</li>\n</ul>\n<p><strong>Duties &amp; Responsibilities:</strong></p>\n<ul>\n<li>Architect and build web applications.</li>\n<li>Work with product designers and clients to clarify requirements, prototype functionality and build products.</li>\n<li>Plan, estimate and prioritize work in a collaborative and distributed team.</li>\n</ul>\n<p><em>Citrusbyte expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Citrusbyte is an equal opportunity employer.</em></p>\n<p><em>No statements by Citrusbyte are intended to create an offer of employment unless made in a writing signed by an officer of the company and no offer shall become effective unless countersigned by the prospective employee.</em></p>", "location": "Remote", "company": "Citrusbyte", "appLink": "<p>Apply directly on our <a href=\"https://citrusbyte.applytojob.com/apply/zxOtZOuNZt/Experienced-Backend-Engineer-JavaReact?source=GitHub%20Jobs\">job board</a></p>"}}, {"model": "api.job", "pk": 125, "fields": {"title": "Salesforce Engineer", "description": "<p>WHO WE ARE:\nCanadians spend over $70B annually on their homes - whether it’s major renovations, or small repairs and maintenance work. This journey often starts by finding the right contractor. HomeStars is the leading platform in Canada, helping homeowners with their home renovation needs by allowing them to search our database of companies and hundreds of thousands of reviews. Every month over half a million homeowners visit HomeStars to research and connect with the best rated home professionals near them. Home Professionals advertise on HomeStars to tell their story, and grow their business with highly qualified connections. HomeStars has recently been acquired by ANGI Homeservices Inc., the #1 marketplace in the US for helping homeowners connect with the best home service providers.</p>\n<p>WHY JOIN US:\nHomeStars is looking to continue to build a positive, winning culture and that starts with hiring great people like you! If you are looking to be work or be a part of organization with an exceptional environment, we want to hear from you!</p>\n<p>Perks of working at HomeStars:\n-We are growing fast. HomeStars is part of the ANGI Homeservices Inc. family.</p>\n<p>-Excellent Benefits Package. We want a healthy and productive team.</p>\n<p>-Company wide social events and team building activities.</p>\n<p>-December Break. The office is closed the week before New Year’s.</p>\n<p>-Personal Growth. We seek to provide employees with constructive feedback to foster their career growth.</p>\n<p>-Beautiful brick &amp; beam office in the heart of the entertainment district in Toronto.</p>\n<p>-Rec room with lounge, ping pong, darts and foosball.</p>\n<p>ABOUT THE ROLE:\nWe are looking for a Salesforce.com Developer who will drive the implementation of Salesforce and its utilization across our organization. The Salesforce Engineer will manage the technical aspects of Salesforce CRM application.</p>\n<p>THE OPPORTUNITY:\n-Work in a fast-paced, agile project environment with small, focused teams.</p>\n<p>-An opportunity to work on a range of platforms such as: Salesforce, Web Applications, Android, iOS.</p>\n<p>-Gain hands on experience with the latest technologies.</p>\n<ul>\n<li>\n<p>Work closely with both the Salesforce and Engineering team at HomeStars.</p>\n</li>\n<li>\n<p>Responsible for the technical aspects of Salesforce.</p>\n</li>\n</ul>\n<p>-Develop custom solutions in VisualForce, Apex, Java, AJAX, and other key technologies.</p>\n<p>-Develop and maintain Visualforce, Apex, and Integration tools to other third party solutions.</p>\n<p>-Working closely with the other departments in order to respond to user’s questions and issues.</p>\n<p>REQUIREMENTS:\n-2-3 years of experience with software development (Java and/or C# preferred).</p>\n<p>-Ability to organize and prioritize responsibilities effectively in order to meet deadlines</p>\n<p>-Understanding of multiple programming environments and tools.</p>\n<p>-Experience with Cloud or Saas solutions.</p>\n<p>-Knowledge of data management, SQL, SOA design principles.</p>\n<p>-Understanding of Ruby on Rails, NodeJS, JavaScript,HTML, CSS, and JSON, and exposure to REST based web services.</p>\n<p>-Understanding of the Salesforce platform (Admin/Config, Apex, VisualForce, Triggers, etc.).</p>\n<p>-Salesforce experience as a developer or end user.</p>\n<p>BENEFITS:\nWe are an equal opportunity employer and do not discriminate based upon race, religion, colour, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>", "location": "Toronto", "company": "Homestars", "appLink": "<p>Email resume directly to:\n<a href=\"mailto:jessica.chester@homestars.com\">jessica.chester@homestars.com</a></p>"}}, {"model": "api.job", "pk": 126, "fields": {"title": "Senior Software Developer, Server-Side Technologies", "description": "<p>The word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.</p>\n<p>We are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.</p>\n<p>Who you are</p>\n<ul>\n<li>You enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks</li>\n<li>You want to be part of a small team inside a large company with massive opportunity for growth</li>\n<li>You enjoy collaboration with other teams including product, biz dev, and our in-house QA team</li>\n<li>You eagerly dig into complex engineering problems</li>\n</ul>\n<p>What we do</p>\n<ul>\n<li>Write scalable back-end and front-end code in JRuby, Java, and JavaScript</li>\n<li>Experiment with new tech to find the right tool for the job</li>\n<li>Maintain high code quality through code reviews and automated tests</li>\n<li>Use Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications</li>\n</ul>\n<p>How we do it</p>\n<ul>\n<li>Ruby/Rails</li>\n<li>JavaScript (JQuery, AngularJS, Vue.js)</li>\n<li>IntelliJ IDEA / TeamCity</li>\n<li>AWS (EC2, EB, RDS)</li>\n<li>Google Cloud (BiqQuery, Dataflow, Cloud Functions)</li>\n<li>MySQL</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>A highly competitive compensation package</li>\n<li>401k with company match</li>\n<li>Paid vacation, work from home, and sick days</li>\n<li>Annual personal development budget to attend a conference of your choice</li>\n<li>Designated time to work on the company-related projects you feel strongly about</li>\n<li>Macbook Pros, dual monitors, and a quiet working space</li>\n<li>Catered lunch at least once a week</li>\n<li>Monthly company events</li>\n</ul>\n<p>Jun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.</p>\n<p>Total compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.</p>", "location": "New York, NY", "company": "Jun Group", "appLink": "<p><a href=\"https://grnh.se/06736d9f2\">https://grnh.se/06736d9f2</a></p>"}}, {"model": "api.job", "pk": 127, "fields": {"title": "Lead Full Stack Developer", "description": "<p>The Job:</p>\n<p>Traction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.</p>\n<p>This role will see you leading a team of developers as well as being an individual contributor to the team.</p>\n<p>We’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.</p>\n<p>Must be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.</p>\n<p>Core Responsibilities:</p>\n<ul>\n<li>Act as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers</li>\n<li>Work closely with the development manager to ensure requirements and timelines are met</li>\n<li>Work closely with the development manager and back-end teams to architect and integrate front-end code</li>\n<li>Develop advanced applications with a mixture of third-party and proprietary tools and libraries</li>\n</ul>\n<p>Skills and Experience:</p>\n<ul>\n<li>Experience as a lead developer</li>\n<li>2+ years of experience building websites using HTML, CSS, and JavaScript</li>\n<li>8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)</li>\n<li>8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.</li>\n<li>8+ years of experience in modeling n-tier applications</li>\n<li>6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus</li>\n<li>Experience writing unit tests for web applications</li>\n<li>Experience with containers and container platforms (Docker, Mesos, Kubernetes)</li>\n<li>Experience in defining continuous integration build processes for front-end web development</li>\n<li>Familiarity with CI/CD strategy (AWS, Heroku, Google Cloud)/</li>\n<li>Knowledge of common design patterns in web development (i.e., MVC, MVVM)</li>\n<li>Working knowledge of source control software such as Git (preferred) or SVN</li>\n<li>Exposure to Agile project management methodologies</li>\n<li>Ability to multi-task and manage tasks with varying priorities</li>\n<li>Must be able to brainstorm and communicate technology ideas and issues with peers and management</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Experience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning</li>\n<li>Willingness to learn new technologies and implement in short time</li>\n<li>Comfortable working in a multi-discipline, geographically dispersed team</li>\n<li>Experience in leading a team of developers through all processes of development and integration, including test automation</li>\n</ul>\n<p>Education: BA or BS in computer science or equivalent experience</p>\n<p>Extra Credit:</p>\n<ul>\n<li>Experience with e-commerce</li>\n<li>Knowledge of accessibility specifications</li>\n<li>Experience with GraphQL</li>\n<li>Experience with Scala</li>\n</ul>\n<p>Our humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.</p>\n<p>Will you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.</p>", "location": "Sunnyvale, CA", "company": "Traction", "appLink": "<p><a href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\">https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer</a></p>"}}, {"model": "api.job", "pk": 128, "fields": {"title": "Senior Software Engineer (m/f)", "description": "<p>Who is Clark (<a href=\"http://www.clark.de\">www.clark.de</a>)?</p>\n<p>Since our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!</p>\n<p>As our Senior Software Engineer, you..</p>\n<ul>\n<li>play a central role in the design and development of our backend system and architecture</li>\n<li>actively contribute to product management and influence our features right from the start</li>\n<li>lift the intelligence of our robo advisor and the efficiency of our insurance operations team</li>\n<li>closely interact with colleagues who use your software to service our customers</li>\n<li>conceptualise and deliver features on a platform that will soon serve &gt; 500000 customers.</li>\n</ul>\n<p>Your Background, you...</p>\n<ul>\n<li>have gained a Technical University or Bachelor's degree</li>\n<li>have minimum 4 years experience in software engineering and web development, incl. 2 years Ruby on Rails, as well as other languages</li>\n<li>a deep understanding of modern software architecture and software design principles, e.g. SOLID, Event Processing, and Domain Driving Design, git, scrum and agile approaches</li>\n<li>test-driven development and quality assurance through automated testing are selfevident</li>\n<li>good knowledge of cloud infrastructure and continuous deployment</li>\n<li>experience with Javascript Frontend Frameworks especially with Ember are a plus</li>\n<li>excellent skills in handling SQL and relational database</li>\n</ul>\n<p>This is Clark – this is what we love to offer you:</p>\n<p>besides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses!\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch &amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.</p>", "location": "Frankfurt", "company": "Clark Germany GmbH", "appLink": "<p>Hi,</p>\n<p>to apply please send us, your</p>\n<p>Motivation Letter, CV &amp; Github Profile</p>\n<p>You can apply through our greenhouse page, to get a quick reply:\n<a href=\"https://www.clark.de/de/jobs?gh_jid=4040394002\">https://www.clark.de/de/jobs?gh_jid=4040394002</a></p>\n<p>Looking forward to get to know you.</p>\n<p>Cheers, Hanan &amp; Clark Recruitment Team</p>"}}, {"model": "api.job", "pk": 129, "fields": {"title": "Senior Frontend Developer (m/f)", "description": "<p>Who is Clark (<a href=\"http://www.clark.de\">www.clark.de</a>)?</p>\n<p>Since our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!</p>\n<p>As our Senior Frontend Developer, you..</p>\n<ul>\n<li>blend concepts of web, mobile, and chat into an awesome user experience</li>\n<li>work with rockstar designers who deliver you pixel perfect sketch files to get beyond what is imaginable</li>\n<li>influence the choice and design of upcoming features by getting involved in product management</li>\n<li>apply latest frontend technologies to deliver working software</li>\n</ul>\n<p>Your Background, you...</p>\n<ul>\n<li>have gained a Technical University or Bachelor's degree</li>\n<li>have minimum 2 years experience in developing Web Applications using modern Frameworks (e.g. Angular, Ember)</li>\n<li>are strong in applying CSS &amp; SASS, as well as responsive design</li>\n<li>Nice to have: you previously develoeped hybrid mobile apps and have knowledge of android or iOS design guidelines</li>\n<li>Big plus: having worked with ruby on rails</li>\n<li>have a sense for good user experience</li>\n<li>see transitions and animations as a natural of Web Design</li>\n<li>are experienced in using content management systems</li>\n<li>have a thorough understanding of software design patterns and how to structure larger web applications in Javascript</li>\n<li>are applying automated UI Testing</li>\n</ul>\n<p>This is Clark – this is what we love to offer you:</p>\n<p>beside the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses!\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch &amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.</p>", "location": "Frankfurt", "company": "Clark Germany GmbH", "appLink": "<p>Hi,</p>\n<p>to apply please send us, your</p>\n<p>Motivation Letter, CV &amp; Github Profile</p>\n<p>You can apply through our greenhouse page, to get a quick reply: <a href=\"https://www.clark.de/de/jobs?gh_jid=4039724002\">https://www.clark.de/de/jobs?gh_jid=4039724002</a></p>\n<p>Looking forward to get to know you.</p>\n<p>Cheers, Hanan &amp; Clark Recruitment Team</p>"}}, {"model": "api.job", "pk": 130, "fields": {"title": "Senior Architect (m/f)", "description": "<p>Who is Clark (<a href=\"http://www.clark.de\">www.clark.de</a>)?</p>\n<p>Since our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!</p>\n<p> </p>\n<p>As our Senior Architect (m/f), you..</p>\n<ul>\n<li>work with engineering managers, product managers, technical leads and other engineers to design, develop and deliver our intelligent consumer insurance platform.</li>\n<li>stay hands on in coding &amp; software development practices by actively contributing to features.</li>\n<li>ensures the logical and systematic conversion of business, customer and product requirements into flexible technical solutions which support current and future needs.</li>\n<li>collaborate with cross-functional teams to analyze and decompose complex software systems.</li>\n<li>maintain up to date documentation of our current architecture and plan our architecture roadmap.</li>\n<li>plan the migration and subsequent decommissioning of partner systems onto the Clark platform.</li>\n<li>bring together different perspectives and opinions to come to a common approach.\n </li>\n</ul>\n<p>Your Background, you...</p>\n<ul>\n<li>have minimum 5 years experience in the development of transactional, mission critical applications in heterogeneous environments.</li>\n<li>pragmatic application of UML, BPMN and initial experience of TOGAF or related architecture frameworks.</li>\n<li>knowledge in Domain Driven Design and Event Driven Architecture is highly desired.\ncloud architecture experience (SaaS, PaaS, IaaS, etc.) incl. containerisation, kubernetes, AWS.</li>\n<li>in-depth knowledge of design &amp; enterprise integration patterns.</li>\n<li>industry expertise in financial services.</li>\n<li>experience in product line engineering and software customisation.</li>\n<li>knowledge of &gt; 3 programming languages, incl. Ruby\n </li>\n</ul>\n<p>This is Clark – this is what we love to offer you:</p>\n<p>besides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\ncompetitive Salary\nlearning budget for your personal development\nshares in our Company\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nexplore new collaboration models with renowned partners\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses inhouse.\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch &amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.</p>\n<p> </p>", "location": "Frankfurt", "company": "Clark Germany GmbH", "appLink": "<p>Hi,</p>\n<p>to apply please send us, your</p>\n<p>Motivation Letter, CV &amp; Github Profile</p>\n<p>You can apply through our greenhouse page, to get a quick reply: <a href=\"https://www.clark.de/de/jobs?gh_jid=4090598002\">https://www.clark.de/de/jobs?gh_jid=4090598002</a></p>\n<p>Looking forward to get to know you.</p>\n<p>Cheers,\nHanan &amp; Clark Recruitment Team</p>"}}, {"model": "api.job", "pk": 131, "fields": {"title": "Full stack developer for new sustainability platform", "description": "<p>We are looking for a freelance developer to join our team of four taking our radical <a href=\"http://www.oneplanet.com\">www.oneplanet.com</a> platform to the next level. The company is a for-profit enterprise being set up by leading not-for-profit, Bioregional.</p>\n<p>You are a full stack developer but focusing on the front end working with our user interface designer and reporting to our Acting CTO. You want to join a small team and make a contribution to social and environmental impact.</p>\n<p>We're working on European timezones but could have some flexibility. We are an equal opportunities company and would particularly welcome applications from women developers.  Remuneration offered in £3K per month freelance but with opportunity after Year 1 to be offered a good employment package with options.</p>\n<p>As a more technical summary:80% Front-end developer / 20% back-end developer; Knowledge of some of front-end technologies including: HTML / CSS / Responsive design / Javascript / React; Knowledge of some of back-end technologies including: MVC (Model View Controller) / RUBY\nOneplanet.com App is using an innovative framework : <a href=\"https://hyperstack.org/\">https://hyperstack.org/</a> (Full-stack, interactive, web applications in Ruby) Ruby code, compiled by Opal, bundled by Webpack, powered by React.</p>", "location": "London", "company": "Oneplanet.com", "appLink": "<p>Send your resume and short covering email to <a href=\"mailto:pooran.desai@bioregional.com\">pooran.desai@bioregional.com</a></p>"}}, {"model": "api.job", "pk": 132, "fields": {"title": "Senior Python Software Engineer", "description": "<p>You'll be a part of a friendly and expanding team of talented engineers, working on the newest parts of the <em>Paddle</em> ecosystem and helping our Software Sellers sell their products on a platform they trust and rely on.</p>\n<p>Our Engineering department is split into five teams, focusing on different parts of the buyer and seller experience. Teams are fairly static to give every member the chance to become a high performer,, but there's always a chance to try something new. With the engineering team expanding so quickly, values and culture are very important to us, and you'll be expected to help keep the great environment we have currently as we grow.</p>\n<p>You are empowered to use the right language for the job for our services, which at the moment for us means using Golang or Python hosted in Lambda, PHP in ECS using docker, and static React sites statically hosted in S3. We will give you the freedom to make technology and tooling decisions and educate the rest of your colleagues accordingly.</p>\n<p><strong>What you'll do</strong></p>\n<ul>\n<li>Work on high traffic APIs used by hundreds of active vendors</li>\n<li>Create brand new products used by <em>Paddle</em>\n</li>\n<li>Contribute to designing how <em>Paddle</em> uses and develops it’s microservices</li>\n<li>Work collaboratively to design API specifications</li>\n<li>Practise DevOps, you’re responsible for getting your code to production and supporting it</li>\n<li>Use the latest cloud services available to run your code</li>\n<li>Write performant and well-tested code</li>\n<li>Help design a stable platform to support phenomenal growth</li>\n<li>Participate in the recruitment process: CV reviews, interviews, reviewing technical ability and cultural fit</li>\n<li>Be a resource for less senior Engineers to provide mentoring and coaching</li>\n<li>Play a part in an agile team - participate in stand-ups, sprint planning &amp; retrospectives</li>\n</ul>\n<p><strong>We'd love to hear from you if</strong></p>\n<ul>\n<li>You have competent commercial experience developing applications or other software platforms</li>\n<li>You have a strong understanding of the development process from design through to deployment and maintenance and what that means for day-to-day development</li>\n</ul>\n<p><strong>Your technical skill set includes:</strong></p>\n<ul>\n<li>Microservice architecture, design, and standard methodologies with an eye towards scale.</li>\n<li>Building RESTful APis/ web applications using Python</li>\n<li>Unit and behavioural testing</li>\n<li>SQL</li>\n<li>Version control systems (preferably Git)</li>\n<li>Exposure to another language, e.g. PHP, Golang, JavaScript, Ruby</li>\n<li>Exposure to cloud providers (preferably AWS)</li>\n</ul>\n<p><strong>Things you'll learn on the job</strong></p>\n<ul>\n<li>AWS suite - SQS, EC2, ECS+ECR, CloudFormation, S3, RDS, Cloudwatch</li>\n<li>Docker containers and micro-service architecture</li>\n<li>Monitoring and alerting at scale</li>\n</ul>\n<p><strong>Why you’ll love working at Paddle</strong></p>\n<p>We are a diverse team of just over 100 people (quickly on our way to 180+) based near London Bridge (but moving to Shoreditch by EOY). We care deeply about enabling a great culture which is inclusive no matter your background. We celebrate our diverse group of talented employees and we pride ourselves on our transparent, collaborative, friendly and respectful culture.</p>\n<p>We offer a full slate of benefits, including competitive salaries, stock options, pension plans, private healthcare and on-site coaching sessions. We believe in flexible working and offer all team members unlimited holidays and 3 months paid parental leaves regardless of gender. Plus we offer some not-so-standard, extra-fun benefits, which can include anything from joining office football team, taking up in-office yoga lessons or enjoying a board game night. We host regular company get-togethers and quarterly socials. We have weekly catered lunches and of course, fully stocked fridges and cold brew on tap. We value learning and will help you with your personal development where we can — from constant exposure to new challenges and annual learning stipend to regular internal and external training.</p>\n<p><strong>About us</strong></p>\n<p>Our mission is to help software companies succeed — enabling them to focus on creating products the world loves. Hundreds of companies rely on our e-commerce platform to sell their software products globally, as well as our powerful analytics and marketing tools to understand and grow their businesses.</p>\n<p>Our vision is to become the platform that all software companies use to run and grow their business. We aim to replace a fragmented ecosystem of specialised tools with a unified platform that removes the complex burden that comes with running a software business, whilst also providing unparalleled insight to help them grow faster.</p>\n<p>We’re early in our journey but making great progress: Deloitte Fast 50 named us the fastest growing software company in the UK (we’ve tripled revenue every year since our launch in 2012), and we’ve raised over $17m in funding from incredible investors such as Notion, BGF and Kindred.</p>\n<p><strong>Equal opportunities</strong></p>\n<p>We believe in having diverse teams in which everyone can be their authentic self is key to our success. We encourage people from underrepresented backgrounds to apply and we don't discriminate based on race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, marital status, disability or age. Our office is wheelchair friendly and we are a family-friendly employer​.</p>\n<p>Come join us, and find out what the best work of your career could look like for you!</p>", "location": "London", "company": "http://www.paddle.com", "appLink": "<p>Please apply via our website: <a href=\"https://boards.greenhouse.io/paddle/jobs/4107363002?gh_jid=4107363002\">https://boards.greenhouse.io/paddle/jobs/4107363002?gh_jid=4107363002</a></p>"}}, {"model": "api.job", "pk": 133, "fields": {"title": "Frontend Software Engineer", "description": "<p>NOI</p>\n<p>ProntoPro.it è il portale dei professionisti N. 1 in Italia. Aiutiamo milioni di clienti a trovare il professionista di cui hanno bisogno: dal fotografo per il matrimonio, all’idraulico, all’insegnante di chitarra. Stiamo portando meritocrazia e trasparenza in un mercato finora opaco; vogliamo trasformare sia il modo in cui gli italiani scelgono un professionista sia quello in cui i professionisti trovano clienti.</p>\n<p>Siamo una startup in grandissima crescita: a marzo 2015 eravamo 2 persone, oggi siamo più di 100. 29 anni è l'età media, lavoriamo in open space, e riduciamo al minimo la burocrazia (perchè è semplicemente controproducente), ognuno ha grandi responsabilità e impatta direttamente sul nostro successo.</p>\n<p>Abbiamo investitori istituzionali del calibro di Immobiliare.it, e angel investor di alto profilo, che lavorano in Google, Facebook, eBay, McKinsey e Unicredit: non abbiamo più i rischi tipici di una startup. Nel 2017 abbiamo avviato il processo di internazionalizzazione conquistando anche il mercato di Austria e Svizzera, e non é finita qua...</p>\n<p>Cerchiamo persone che vogliano costruire un colosso nel mondo del digital italiano che impatti fortemente la vita di tutti noi. Non è un lavoro tranquillo – ci mettiamo il cuore.</p>\n<p>IL TUO RUOLO</p>\n<ul>\n<li>ProntoPro cambierà il modo in cui i clienti trovano i professionisti. Avrai piena visibilità sul business, non solo sulla tua area. Ci si aspetta quindi che tu apporti valore anche a livello architetturale, a livello di prodotto e a livello strategico, senza limitarti ad eseguire ciò che è esplicitamente richiesto.</li>\n<li>Sarai parte del team Technology, oggi composto da 15 (+) persone e che arriverà a 25 entro fine 2018.</li>\n<li>Creerai un prodotto scalabile che sosterrà la fase di hyper-growth dell'azienda.</li>\n<li>Lavorerai in un ambiente particolarmente attento ai trend tecnologici emergenti e alle metodologie di lavoro agile. In ProntoPro utilizziamo PHP, Symfony, Node.js, SASS, ReactJS, MySQL, AuroraDB, Redis, MongoDB, RabbitMQ, Solr, New Relic, Kubernetes, Docker, Ansible, Git, Drone.io. L’iniziativa personale nell’arricchire/modificare lo stack è un tema a cui siamo molto sensibili, pertanto ci aspettiamo il tuo contributo.</li>\n<li>Parteciperai ad eventi di settore ed avrai la possibilità di raccontare come in ProntoPro abbiamo affrontato e vinto sfide tecnologiche.</li>\n</ul>\n<p>TU</p>\n<p>Stiamo cercando un Software Engineer che voglia unirsi al nostro team Technology.</p>\n<p>Ci aspettiamo che tu abbia una solida esperienza in:</p>\n<ul>\n<li>Javascript, CSS, SASS, SCSS, manipolazione DOM e JS object model</li>\n<li>Scrivere codice pulito, mantenibile, scalabile e aderente ai principi SOLID</li>\n<li>Assicurare test coverage del codice prodotto</li>\n<li>Astrarre il codice prodotto costruendo componenti e librerie riutilizzabili</li>\n<li>Ottimizzare i componenti creati per ottenere massime performances sull'intera gamma di device/browser supportati</li>\n<li>Utilizzare (e quando necessario creare da zero) client e librerie per consumare servizi REST</li>\n<li>Utilizzare strumenti di sviluppo e build (Babel, Webpack, NPM, …)</li>\n<li>Revisionare le pull requests dei tuoi colleghi</li>\n<li>Lavorare in pair programming</li>\n</ul>\n<p>Bonus points:</p>\n<ul>\n<li>ReactJS, Redux e isomorphic React</li>\n<li>WebSocket</li>\n<li>Librerie di data structuring (es. immutable.js)</li>\n<li>Pattern di autenticazione (OAuth2, JWT, …)</li>\n<li>Creare e gestire applicazioni ed ambienti basati su Docker</li>\n<li>Pipeline di continuous integration/delivery in ambienti come Jenkins e Drone.io</li>\n<li>Conoscenza di altri linguaggi di programmazione (PHP, Python, Ruby, …)</li>\n</ul>", "location": "Milan, Italy", "company": "ProntoPro", "appLink": "<p>Simply send us an email with your CV to <a href=\"mailto:peopleops@prontopro.it\">peopleops@prontopro.it</a></p>\n<p>OR apply easily on our website:\n<a href=\"https://prontopro.recruiterbox.com/jobs/fk0hzbs/\">https://prontopro.recruiterbox.com/jobs/fk0hzbs/</a></p>"}}, {"model": "api.job", "pk": 134, "fields": {"title": "Software Engineer", "description": "<p>Stride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’ll be in great company.</p>\n<p>Our goal is to leave our client teams functioning at a higher level than when we found them.  We do this by writing high quality code alongside our clients’ development teams, as well as mentoring their developers, product teams and stakeholders in software development best practices.</p>\n<p>We believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.</p>\n<p><strong>As a Strider, you’ll find a learning opportunity that’s unmatched. You will:</strong></p>\n<ul>\n<li>Be part of an engineering-driven culture, one that has a 4.9 star Glassdoor review and has won Crain’s -Best Places to Work 2 years in a row.</li>\n<li>Write high quality code with some of the smartest engineers in town.</li>\n<li>Immerse yourself in a learning journey that’s second to none. No where else will you find the variety that being a consultant brings, all a subway ride away.</li>\n<li>Mentor and be mentored. Learning weaves a thread through all that we do.</li>\n</ul>\n<p><strong>A Day In The Life of a Stride Software Engineer</strong></p>\n<p>You’ll co-locate and work onsite at your client (all are in NYC). We are proud to call the most outstanding tech teams in NYC our clients, ranging from funded startups to Fortune 500.</p>\n<p>You are empowered to define what work/life balance means to you. Every day for every Strider is different. Here’s how one day might unfold:</p>\n<p>9am: One-on-one with my manager. We grab coffee at Stumptown and talk about my career goals. I’m noodling on a complex React story and I get my manager’s take. We walk away with action items for next week’s one-on-one.</p>\n<p>10am: Daily Standup. I’m at work at the client’s office. They’ve got a really cool setup with dual monitors and nice pairing stations. I’m on a team of 4 Striders and 4 client developers. Our Product Manager kicks off the Standup. It lasts about 10 minutes and then we’re off to code.</p>\n<p>10:10-12:00 Pair Programming. I’m pairing with another Strider. We continue working on the React story from the day before. We have questions for the Product Manager that we ask via Slack.</p>\n<p>12:00-12:30 Travel to Stride</p>\n<p>12:30-1:30 Lunch-n-Learn. Today, Stride’s got a Lunch-n-Learn on Terraform Cloud that I’m psyched about. Stacey, one of our senior engineers, is leading the session. We hold Lunch-n-Learns every few weeks and I go to about half of them.</p>\n<p>1:30-1:45 Travel back to the client’s office.</p>\n<p>1:45-2:45 Retrospective. Retrospectives on my team are amazing. Today we’re retrospecting our last release. I’ve never facilitated a retrospective before, but my goal is to facilitate one this June. We have a nice rhythm and walk away with action items and confidence in the path ahead.</p>\n<p>2:45-6 Pair Programming. I get in a few more hours of coding. This afternoon, my pair is Amy, a junior dev who works for the client. I love mentoring and am really excited to have this time to mentor Amy. I’ve been coding about 3 years myself, so at first the idea of mentoring someone else gave me imposter syndrome, but the Stride approach is fluid and allows for flexibility and it’s been a huge career learning experience for me.</p>\n<p>6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.</p>\n<p><strong>What you’ll be doing</strong></p>\n<ul>\n<li>Writing high quality code, and bringing a ‘teach a team to fish’ mentality to your project.</li>\n<li>Embed with development teams in some of NYC’s most exciting companies to help them up their game and get stuff done.</li>\n<li>Advocate for non-dogmatic Agile software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement.</li>\n<li>Be part of a cross functional team that includes Striders (likely 2-6 Strider engineers plus a product manager) and client employees (likely engineers and other tech roles).</li>\n<li>Work with a variety of tech stacks, and a see a variety of tech teams. We embed with teams who write code in modern tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.</li>\n</ul>\n<p><strong>You’re a fit for Stride if you have:</strong></p>\n<ul>\n<li>3+ years of software development experience</li>\n<li>Experience in multiple programming languages</li>\n<li>Excitement to learn new languages and frameworks</li>\n<li>Experience with TDD, story estimation, test writing, and pair programming</li>\n</ul>\n<p><strong>What you can expect from us:</strong></p>\n<ul>\n<li>Continuous learning on things that you are passionate about</li>\n<li>Competitive Pay and Benefits (including Profit Sharing!)</li>\n<li>Empowerment to work at a self-defined Sustainable Pace</li>\n<li>No travel, all of our clients are located in NYC</li>\n<li>$2,000 and up to two weeks of your time for self-directed professional development</li>\n</ul>", "location": "New York, New York", "company": "Stride Consulting", "appLink": "<p>Follow this link and submit your application!\n<a href=\"https://grnh.se/48e351b21\">https://grnh.se/48e351b21</a></p>"}}, {"model": "api.job", "pk": 135, "fields": {"title": "Experienced DevOps Engineer", "description": "<p><a href=\"https://citrusbyte.com\">Citrusbyte</a> is a software consultancy that believes in using simple tools to solve problems. We build custom systems for both startups and enterprises - You can see our portfolio for more information about our clients.</p>\n<p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p>\n<p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p>\n<p>We are looking for DevOps Engineers with experience using Infrastructure as Code and Configuration Management tools, deploying applications to cloud services such as AWS and Azure. Experience developing backend applications is not required but definitely a plus.</p>\n<h2>Job Requirements:</h2>\n<ul>\n<li>Experience with Infrastructure as Code and Configuration Management tools.</li>\n<li>Proficient in Ruby and at least one other programming language.</li>\n<li>Knowledge of the ELK stack.</li>\n<li>Experience with Prometheus/Grafana for metrics aggregation/visualization.</li>\n<li>Configuration of CI/CD pipelines using Jenkins.</li>\n<li>Experience using Kubernetes.</li>\n<li>Experience with automation tools/platforms.</li>\n<li>Experience with alerting and monitoring tools.</li>\n<li>Experience working in a highly distributed company.</li>\n<li>Being open minded and always learning.</li>\n</ul>\n<h2>Duties &amp; Responsibilities:</h2>\n<ul>\n<li>Design, creation and provisioning of infrastructure.</li>\n<li>Deploy and maintain applications.</li>\n<li>Collaborate with other engineers to implement operational solutions while adhering to and defining organizational best practices.</li>\n</ul>\n<p>_Citrusbyte expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Citrusbyte is an equal opportunity employer.</p>\n<p>No statements by Citrusbyte are intended to create an offer of employment unless made in a writing signed by an officer of the company and no offer shall become effective unless countersigned by the prospective employee._</p>", "location": "United States", "company": "Citrusbyte", "appLink": "<p><a href=\"https://citrusbyte.applytojob.com/apply/jBS24wN4G3/Senior-DevOps-Engineer-Remote-OK?source=GitHub\">Apply directly on our careers page</a>.</p>"}}, {"model": "api.job", "pk": 136, "fields": {"title": "Senior .NET Developer", "description": "<p>Susco helps businesses grow by creating software customized to their unique needs.  We believe that our work helps people live more fulfilling lives by reducing their repetitive tasks, allowing them to concentrate on more valuable work.</p>\n<p>Susco is located in the Greater New Orleans Area and is one of the fastest-growing tech companies in Louisiana.  We develop custom web-based business software with a focus on legacy system conversions.  Our primary development platforms are C# .NET for web services, and Ionic/Cordova for mobile apps.</p>\n<p>Requirements</p>\n<ul>\n<li>5 Years web development experience</li>\n<li>Elicitation of requirements from non-technical business users</li>\n<li>Conceptually design systems based on business requirements</li>\n<li>Perform technical lead role through the SDLC</li>\n<li>Highly proficient in database design and SQL</li>\n<li>Highly proficient in a server-side language such as C#, Java, Ruby, Python, or PHP</li>\n<li>Highly proficient with Javascript</li>\n<li>Experience with CSS/HTML</li>\n<li>Ability to adapt to rapidly changing environments</li>\n<li>Self-motivated with a positive attitude</li>\n<li>Willingness to drive projects to completion in a fast-moving environment</li>\n</ul>\n<p>Nice-to-Have</p>\n<ul>\n<li>Experience with Kendo UI</li>\n<li>Experience with Legacy system conversions</li>\n<li>BS/BA degree</li>\n<li>Azure experience</li>\n<li>Linux experience</li>\n<li>Mobile development experience</li>\n<li>C# Expertise</li>\n<li>Microsoft Visual Studio</li>\n<li>Salesforce Experience</li>\n</ul>\n<p>Responsibilities</p>\n<ul>\n<li>Application Development, primarily ASP.NET (C#.NET)</li>\n<li>Database Design and Maintenance</li>\n<li>Requirements analysis</li>\n<li>Assisting with the development of scope documents and budgets for new work</li>\n<li>Perform work within allotted hourly budgets and within specific timeframes</li>\n<li>Client communication</li>\n</ul>\n<p>Compensation</p>\n<ul>\n<li>Salary: $80,000 - $100,000/year</li>\n<li>3 Weeks PTO + 9 Holidays</li>\n<li>3 Days/year of self-driven learning time like conferences</li>\n<li>Health, Dental, Life, Disability Insurance</li>\n<li>Various Wellness activities paid for</li>\n</ul>\n<p>Our Core Values</p>\n<p><strong>Growth</strong>: We believe we can create a better world by constantly growing as individuals, resulting in growth for the Company and growth for our clients.</p>\n<p><strong>Action</strong>: We believe we don't have good days, we make them.  We believe in being proactive and not reactive. Passivity leads to a lack of involvement, while our focus is on creating the future.  We don't complain, we identify and solve problems.</p>\n<p><strong>Teamwork</strong>: We believe that we are human beings first, coworkers second.  We strive to be cognizant as people with lives outside of this office.  As a high-performance organization, there are times of high stress.  In those times, we rally to get the job done and we recognize our behavior and performance impacts our team.</p>\n<p><strong>Efficiency</strong>: We believe in learning from our mistakes the first time.  We believe there is a time and place for complex solutions for complex problems.  We also have the ability to decompose complex problems into simpler problems. When we see a problem or inefficiency, we have both the responsibility and ability to propose solutions.</p>", "location": "New Orleans, LA", "company": "Susco Solutions", "appLink": "<p><a href=\"http://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer\">http://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer</a></p>"}}, {"model": "api.job", "pk": 137, "fields": {"title": "Full Stack Engineer", "description": "<p>SUPERHUMAN 👉</p>\n<p>We're building the fastest email experience in the world.</p>\n<p>Superhuman is:</p>\n<ul>\n<li>The most wanted product on Product Hunt, with 70K+ people on our waitlist</li>\n<li>Growing revenue 7% week-week, 30% month-month</li>\n<li>Loved and adored: <a href=\"https://twitter.com/SuperhumanCo/timelines/911278863216340992\">see what our users say</a>\n</li>\n<li>Come shape the future of email, communication, and productivity!</li>\n</ul>\n<p>BUILD LOVE 💜</p>\n<p>At Superhuman, we deeply understand <a href=\"https://www.linkedin.com/pulse/goodbye-mr-iwata-rahul-vohra\">how to build products that people love</a>. We incorporate fun and play; we infuse magic and joy; we make experiences that amaze and delight.</p>\n<p>For us, emotive design is not some afterthought.  It is a core part of our strategy.</p>\n<p>CREATE MASSIVE IMPACT 🚀</p>\n<p>We're not solving a small problem, and we're not addressing a small market. We're going after email; the one activity that consumes more of our work day than any other.</p>\n<p>Our ambition doesn't stop there. Next: calendars, notes, contacts, tasks. We are building the productivity platform of the future.</p>\n<p>At Superhuman, you will have massive impact: you will define product strategy, and translate big ideas into experiences that delight. You will create gorgeous products that millions of people use for hours every single day.</p>\n<p>DO THE BEST WORK OF YOUR LIFE 🌟</p>\n<p>As a fullstack engineer, you will join as a core member of a seasoned 5-person team.</p>\n<p>We made products at Apple, Google, LinkedIn, Zynga, Flipboard, and Facebook. We founded Rapportive (acquired by LinkedIn), LiveRamp (acquired for $310M), and built pry (used by 25% of Ruby developers). Our investors include First Round Capital, Sam Altman, and the founders of Gmail, Stripe, AngelList, Intercom.</p>\n<p>This time, we're swinging for beyond the fences. We are building a household brand and a worldwide organization. We are here to do the best work of our lives, and we hope you are too.</p>\n<p>ROLE 👩🏽‍💻👨‍💻</p>\n<ul>\n<li>Develop new products and features, improve existing products and features</li>\n<li>Become an expert in web app development</li>\n<li>Expand your development experience across the stack and to other platforms</li>\n<li>Contribute in the product process: thinking through UX, designing beautify UI, and working with - customers to solve their problems</li>\n<li>Develop and utilize your skills as a mentor and leader</li>\n<li>Help estimate, plan and execute on projects, features, and integrations</li>\n<li>Champion code quality, new technologies, and architectural design within the company</li>\n<li>Technologies we use: React, Golang, Postgres, Electron, Google Cloud</li>\n</ul>\n<p>SOUND LIKE YOU? 🙌</p>\n<ul>\n<li>Experience: You are a proficient engineer with a well rounded software engineering background\nYou have 3+ years of professional full stack web development experience, working across the stack from the database to the UI\nYou have a deep understanding of browser Javascript (including the DOM and platform APIs)</li>\n<li>Product focused: You take pride in building elegant and beautiful product</li>\n<li>Problem solver: You excel at understanding and solving complex problems. You have astonishing attention to detail.</li>\n<li>Quality communicator: You can confidently break down tricky topics in writing and in person.</li>\n<li>Surprisingly efficient: You get a lot done quickly, and can translate your skills into new processes that your team will follow.</li>\n<li>Leadership: You will rapidly grow into a company leader. You will build company culture and help shape our future.</li>\n<li>Location: San Francisco Bay Area</li>\n</ul>\n<p>BENEFITS 🎁</p>\n<ul>\n<li>Flexible vacation\n-Catered lunch (5x per week)</li>\n<li>$3k desk set up of your choice</li>\n<li>Full medical, dental, and vision insurance</li>\n<li>Paid parental leave</li>\n<li>401K</li>\n</ul>\n<p>Superhuman is an equal opportunity employer: we value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>", "location": "San Francisco", "company": "Superhuman", "appLink": "<p>Please apply: <a href=\"https://grnh.se/ece028bb1\">here</a>. :)</p>"}}, {"model": "api.job", "pk": 138, "fields": {"title": "SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS", "description": "<p><strong>Job Description</strong></p>\n<p>Analytics Fire builds custom software for the solar power industry. We’re looking for a senior full-stack developer with a willingness to acquire deep expertise around Ruby, Python, and React.js, in order to help us expand to support additional new high-tech sectors.</p>\n<p>Analytics Fire is a small, distributed team working on a range of interesting projects. For example, last year we worked on a scalable IoT platform for utility grade solar power plants, a sales and design tool for residential solar, and a machine-learning powered autonomous cleaning robot. We’re looking for a fun, reliable, and highly collaborative, senior dev to join our team.\nFor reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:</p>\n<ul>\n<li>Front-end: JavaScript / React / Angular</li>\n<li>Back-end: Ruby / Python / Node.js</li>\n<li>Embedded (IoT): C, Embedded Linux, MQTT</li>\n<li>Embedded (robotics): C/C++, ROS</li>\n<li>Modern software techniques: RESTful APIs, SOA, PaaS, etc</li>\n<li>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</li>\n<li>Occasionally we need to do a small amount of work around: SFDC, iOS, Android, ARKit</li>\n</ul>\n<p>This is a remote position. We’re flexible about location and hours, so long as your working hours are in a very heavily US-overlapping time zone (eg: North America, Central America, South America, etc). We’re a really great match for a senior dev in a US-overlapping timezone who wants to work hard on interesting projects, while also having flexibility around time and geography.</p>\n<p><strong>Skills &amp; Requirements</strong></p>\n<p>Ideally, you should have 5+ years commercial full stack development, ideally within a startup environment. You should be comfortable autonomously driving your own high quality / high velocity contributions using a range of technologies.</p>\n<p>We work with a variety of technologies, but are currently specifically looking for someone that has or can obtain expert level skills around Python, Ruby, and React.js.</p>\n<p><strong>About Analytics Fire</strong></p>\n<p>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</p>\n<p>“Our goal founding, Analytics Fire, was to create the engineering department that we always dreamed of working for. Our dream is to be able to spend our time working on interesting problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</p>", "location": "Remote", "company": "Analytics Fire", "appLink": "<p>Please email your resume and cover letter to <a href=\"mailto:join-us@analyticsfire.com\">join-us@analyticsfire.com</a></p>"}}]